[
    {
        "title": "BIOL 10 - The Living World",
        "units": "3 unit(s)",
        "description": "Provides students with an understanding of the most fundamental concepts of modern biology including ecology (the interaction between organisms and their environment), human inheritance, the structure and function of living organisms, evolution, strategies for survival and reproduction, and biotechnology.  Satisfies B2: Life Science.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Not an elective in the department majors. Sustainability Related - SDG 15: Life on Land"
    },
    {
        "title": "BIOL 20 - Ecological Biology",
        "units": "3 unit(s)",
        "description": "Introduction to diversity, ecology, evolution and behavior. In conjunction with BIOL 21 a more complete survey of biology.  Misc/Lab: Lecture 2 hours/lab 3 hours/field trips.Satisfies B2 + B3: Life Science & Lab.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Not an elective in the department majors."
    },
    {
        "title": "BIOL 21 - Human Biology",
        "units": "3 unit(s)",
        "description": "Introduction to physiology, reproduction, development, heredity and aging. With BIOL 20 a more complete survey of biology.  Misc/Lab: Lecture 2 hours/Lab 3 hours.Satisfies B2 + B3: Life Science & Lab.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Not an elective in the department majors."
    },
    {
        "title": "BIOL 30 - Principles of Biology I",
        "units": "4 unit(s)",
        "description": "Cellular and physiological aspects of biological diversity. Concepts include: biomolecules, cellular structures/function, cell-cell communication, cellular energetics, molecular evolution, gene expression, enzymes, and animal physiological systems.  Misc/Lab: Lecture 3 hours/Lab 3 hours.Satisfies B2 + B3: Life Science & Lab.",
        "prereqs": "Writing Enrollment Group W-I or W-II, or ENGL 1AF with a grade of CR, or ENGL 1A with a grade of C- or better; Math Enrollment Group M-I or M-II, or completion of a GE Area B4 course. Must be majoring in Biology (all), Biomedical Eng, Biochemistry, ENVS (all), Forensic Science (all), Nutritional Science, Meterology-CS, Kinesiology, Computer Science, and Communicative Disorders.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 31 - Principles of Biology II",
        "units": "4 unit(s)",
        "description": "The diversity of life and the mechanisms by which that diversity has arisen. Concepts include: scientific method, origins of life, adaptation of organisms to different environments, ecology, and evolution.  Lecture 3 hours/Lab 3 hoursSatisfies B1 + B3: Physical + Lab Science",
        "prereqs": "BIOL 30 (with a grade of C- or better for all Biology majors). Must be majoring in Biology (all), Biomedical Eng, Biochemistry, Forensic Science (all), Environmental Studies (all), Nutritional Science, Meteorology - Climate Science Concentration, Kinesiology, Computer Science, and Communicative Disorders.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 54 - Human Understanding",
        "units": "3 unit(s)",
        "description": "Major issues in health and disease, learning and memory, maturation and aging (such as diet, exercise, mind-body medicine, and addictions). Emphasis on learning how to understand and apply physiologic information for personal growth and lifelong learning.  Satisfies E: Human Understanding & Development.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 55 - Biostatistics",
        "units": "3 unit(s)",
        "description": "Introductory experimental design and statistical analysis of biological data from manipulated experiments. Experience in designing and analyzing experiments utilizing both univariate and multivariate tests. Lecture 2 hours/Lab 3 hours",
        "prereqs": "BIOL 30 or BIOL 31 with a grade of C- or better, or instructor consent. Must be a declared Biology Major (all) or Environmental Studies Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 65 - Human Anatomy",
        "units": "4 unit(s)",
        "description": "Introductory study of gross and microscopic human anatomy including corresponding pathology. For majors in nursing and kinesiology.  Misc/Lab: Lecture 3 hours/lab 3 hours.Satisfies B2 + B3: Life Science & Lab.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Not an elective in the department majors."
    },
    {
        "title": "BIOL 65O - Human Anatomy",
        "units": "4 unit(s)",
        "description": "Introductory study of gross and microscopic human anatomy including corresponding pathology. For majors in nursing and kinesiology. This online anatomy course is not intended for students pursuing degrees in kinesiology, recreation (therapeutic recreation) or to meet the anatomy prerequisite for occupational therapy at SJSU. Students who intend to transfer the human anatomy course to another institution which requires an in class lab should enroll in BIOL 65.  Misc/Lab: Lecture 3 hours/lab 3 hours.Satisfies B2 + B3: Life Science & Lab.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Not an elective in the department majors."
    },
    {
        "title": "BIOL 66 - Human Physiology",
        "units": "5 unit(s)",
        "description": "Explanation of physiological principles from the molecular and cellular-levels to organ systems. Neural and endocrine controls and integration among systems. Health care orientation.  Misc/Lab: Lecture 3 hours/lab 3 hours/seminar 1 hour.Satisfies B2 + B3: Life Science & Lab.",
        "prereqs": "High school algebra. Recommended: Human Anatomy, CHEM 30A .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Not an elective in the major departments. A grade of C or better is required to receive B2 and B3 GE credit."
    },
    {
        "title": "BIOL 100W - Scientific Communication Workshop",
        "units": "3 unit(s)",
        "description": "Analysis and communication of scientific research to both scientific and general audiences. Satisfies upper division writing requirement. Satisfies SJSU Studies R: Earth, Environment, and Sustainability + Writing in the Disciplines (WID).",
        "prereqs": "BIOL 30 and BIOL 31 (with grades of C- or better); A3 or equivalent second semester composition course (with a grade of C- or better); completion of core GE; and upper division standing. Or Graduate or Postbaccalaureate level. Allowed Declared Majors: Biology (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Must be passed with C or better to satisfy the CSU Graduation Writing Assessment Requirement (GWAR)."
    },
    {
        "title": "BIOL 101 - Origins of Life",
        "units": "3 unit(s)",
        "description": "Process of evolution, fossil evidence for life origins, and the place of humans in nature. Satisfies SJSU Studies R: Earth, Environment, and Sustainability.",
        "prereqs": "Completion of Core General Education and upper division standing are prerequisites to all SJSU studies courses. Completion of, or co-registration in, 100W is strongly recommended.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Not an elective in the Biological Sciences Department majors."
    },
    {
        "title": "BIOL 105 - Principles of Developmental Biology",
        "units": "3 unit(s)",
        "description": "Emphasis on human development. Other animal systems (fly, frog, chick, mouse) will also be studied to aid in understanding anatomical, physiological, genetic and molecular mechanisms operating during gametogenesis, fertilization, cleavage, gastrulation and organogenesis.",
        "prereqs": "BIOL 30 and BIOL 31  (with a grade of C- or better in each), or instructor consent; BIOL 115 (with a grade of C or better). Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 106 - Physiological Ecology",
        "units": "3 unit(s)",
        "description": "Study of the interaction of an organism with its environment. Looking at both plants and animals, students examine how both structure and function interact to enable an organism to survive under particular environmental conditions.",
        "prereqs": "BIOL 113 or (with a grade of C or better); BIOL 100W ; CHEM 8 or CHEM 112A and CHEM 112B (with a grade of C- or better), upper division standing, or instructor consent. Must be a declared major in Biological Sciences.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Sustainability Related - SDG 15: Life on Land",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 106L - Physiological Ecology Lab",
        "units": "1 unit(s)",
        "description": "Experimental labs that illustrate/demonstrate key physiological concepts of plant and animal adaptations to their environment, as discussed in the lecture section, BIOL 106 - Physiological Ecology. 3 hours lab.",
        "prereqs": "BIOL 113 (with a grade of C or better); BIOL 100W ; CHEM 8 or CHEM 112A and CHEM 112B (with a grade of C- or better), upper division standing, or instructor consent. Must be a declared major in Biological Sciences.",
        "coreqs": "BIOL 106 .",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 107 - Immunology",
        "units": "3 unit(s)",
        "description": "Provides information about all areas of immunology with emphasis on the basic concepts of immune mechanisms of the acquired and innate immune systems. Uses the basic information to study immune disorders and the immune response to infectious agents.",
        "prereqs": "MICR 101 (with a grade of C or better), or instructor consent. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 107L - Immunology Laboratory",
        "units": "2 unit(s)",
        "description": "The experiments in this beginning immunology laboratory are designed to study both the innate and acquired immune systems. Experimentation into the formation, function and detection of antibodies provides students with skills in basic immunologic techniques. Flow cytometry is used in identification of immune cells as well as functional assays of complement mediated phagocytosis. Lab 3 hours.",
        "prereqs": "Must be a declared Biology Major (all).Pre/",
        "coreqs": "BIOL 107 or instructor consent.",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 109 - Human Neuroanatomy and Physiology",
        "units": "4 unit(s)",
        "description": "Gross and microscopic structure and function of the human nervous system. Introduction to experimental and clinical techniques. Misc/Lab: Lecture 3 hours/lab 3 hours.",
        "prereqs": "BIOL 65 or instructor consent",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Not an elective in the department majors."
    },
    {
        "title": "BIOL 110 - Biodiversity and Biopolitics",
        "units": "3 unit(s)",
        "description": "Application of ecological principles to the conservation of biodiversity and the management of ecosystems. Analysis of biological, economic, social and political interrelationships involved in conservation. Satisfies SJSU Studies R: Earth, Environment, and Sustainability.",
        "prereqs": "Completion of Core General Education and upper division standing are prerequisites to all SJSU studies courses. Completion of, or co-registration in, 100W is strongly recommended.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Not an elective in the Biological Sciences Department majors.  Sustainability Focused - SDG 15: Life on Land"
    },
    {
        "title": "BIOL 111 - Fire Ecology",
        "units": "4 unit(s)",
        "description": "Fire is a fundamental ecological process in many terrestrial ecosystems. Examination of fire ecology and ecologically-based management of a variety of ecosystems. Lecture 2 hours/Lab 6 hours.",
        "prereqs": "Any GE Area B1 or B2 class. Biology major (all) or Wildfire Science minor. Other majors considered with instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 113 - Principles of Systematics",
        "units": "3 unit(s)",
        "description": "Students gain the understanding and skills needed to taxonomically study biodiversity, including the use of morphological and DNA sequence characters to examine phylogeny, and use of a range of biodiversity research techniques and tools.",
        "prereqs": "BIOL 115 or BIOL 118 (with a grade of C or better), or instructor consent. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Cross-listed with BOT 113 / ENT 113 / ZOOL 113 . Biological Sciences is responsible for scheduling.",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 114 - Functional Morphology",
        "units": "3 unit(s)",
        "description": "Develops understanding and skills needed to taxonomically study biodiversity, including the use of morphological and DNA sequence characters to examine phylogeny, and use of a range of biodiversity research techniques and tools. Lecture 2 hours/Lab 3 hours.",
        "prereqs": "BIOL 115 or BIOL 118 (with a grade of C or better), or instructor consent. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Cross-listed with BOT 114 / ENT 114 / ZOOL 114 . Biological Sciences is responsible for scheduling.",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 115 - General Genetics",
        "units": "4 unit(s)",
        "description": "Principles and methods of microbial, plant and animal genetics. Mendelism, cytogenetics, molecular genetics, mutation, quantitative genetics and genetic aspects of evolution. Lecture 3 hours/Discussion 1 hour.",
        "prereqs": "BIOL 30 and BIOL 31 (with a grade of C- or better in each), or instructor consent; CHEM 1A and CHEM 1B  (with a grade of C or better in each). Must be a declared Biology (all) or Chemistry (all) or Forensic Science (Biology concentration only) major.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 116 - Molecular Genetics",
        "units": "4 unit(s)",
        "description": "Molecular genetics of eukaryotes. Replication, repair, mutation, regulation of gene expression, gene organization and methods of recombinant DNA research.",
        "prereqs": "BIOL 115 or MICR 166 , and CHEM 135 (all with a grade of C or better). Must be a declared Biological Sciences BS, Molecular Biology concentration major. Other Biological Sciences majors must get instructor consent.",
        "coreqs": "BIOL 116L .",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 116L - Molecular Genetics Laboratory",
        "units": "3 unit(s)",
        "description": "Lab experience in modern molecular biology techniques used in research and industry settings. Techniques may include nucleic acid purification, enzymatic modification of nucleic acids, recombinant DNA cloning, PCR, Quantitative PCR, bacterial transformation and culture, agarose gel electrophoresis. The techniques chosen depend upon the course instructor. Lecture 1 hours/Lab 6 hours.",
        "prereqs": "No prerequisites",
        "coreqs": "BIOL 116 , and must be a declared Biological Sciences BS, Molecular Biology concentration major. Other Biological Sciences majors must get instructor consent.",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 117 - Human Genetics",
        "units": "3 unit(s)",
        "description": "Mendelian traits, classical and molecular cytogenetics, DNA variation, sex determination, gene mapping, mutation, population genetics, multifactorial inheritance, genetic counseling and prenatal diagnosis.",
        "prereqs": "BIOL 115 (with a grade of C or better). Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 118 - Evolution",
        "units": "4 unit(s)",
        "description": "An analysis of the patterns and processes of biological evolution. Topics include: history and philosophy of evolutionary thought; macroevolution and biogeography; selection, adaptation, and other forces; sexual selection and behavior; genetics, genomics, and the molecular basis of evolution. Lecture 3 hours/Seminar 1 hour.",
        "prereqs": "BIOL 30 and BIOL 31  (with a grade of C- or better in each for Biology Majors). Must be a declared Biology or Chemistry Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Sustainability Related - SDG 15: Life on Land",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 119 - Neurogenetics",
        "units": "3 unit(s)",
        "description": "Cellular and molecular neuroscience at the neuron, synapse and circuit level, including electrical and chemical signaling. Neurophysiology of development, maintenance and modification of neural circuits. Molecular genetics of neurological disorders such as autism, schizophrenia, Alzheimers disease, and mood disorders.",
        "prereqs": "BIOL 115 (with a grade of C or better). Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 122 - Bacterial Diversity",
        "units": "2 unit(s)",
        "description": "Study of the characteristics and microecology of unusual prokaryotes. Molecular and traditional approaches will be discussed.",
        "prereqs": "MICR 101 (with a grade of C or better), or instructor consent. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Cross-listed with MICR 122 . Biological Sciences is responsible for scheduling. Sustainability Related - SDG 15: Life on Land",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 122L - Bacterial Diversity Laboratory",
        "units": "2 unit(s)",
        "description": "Laboratory techniques in bacterial diversity. 6 hours Lab",
        "prereqs": "MICR 101 (with grade of C or better) or Instructor Consent. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Cross-listed with MICR 122L . Biological Sciences is responsible for scheduling.",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 123A - Bioinformatics I",
        "units": "3 unit(s)",
        "description": "Introduction to algorithms, tools, and databases of Bioinformatics. Biological foundations: central dogma; sequence databases; pairwise alignment algorithms and tools; Blast; phylogenetics. Possible additional topics: protein structure, multiple sequence alignment, next-gen sequencing, epigenetics, CRISPR. Project applying these approaches to real-world problems.",
        "prereqs": "CS 46B or BIOL 31 , or instructor consent; Allowed Majors: Computer Science, Data Science, Software Engineering, Biology, Chemistry or MS Bioinformatics.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Cross-listed with CS 123A / SE 123A . Computer Science is responsible for scheduling.",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 123B - Bioinformatics II",
        "units": "3 unit(s)",
        "description": "Advanced Bioinformatics algorithms, tools, databases. Biological background; protein structure/function; sequencing technology; sequence identification; transcriptomics; metagenomics; CRISPR. Possible additional topics: functional genomics; protein networks; drug discovery; pathway analysis; immunoinformatics; analysis pipelines; machine learning applications. Project applying advanced approaches to real-world problems.",
        "prereqs": "CS 123A / BIOL 123A / SE 123A ; Allowed Majors: Computer Science, Data Science, Software Engineering, Biology, Chemistry or MS Bioinformatics.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Cross-listed with CS 123B / SE 123B . Computer Science is responsible for scheduling.",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 124 - Systems Physiology",
        "units": "3 unit(s)",
        "description": "Physiology of organ systems with emphasis on the human. Neural & hormonal communication, muscle, cardiovascular, respiratory, urinary, digestive, endocrine, and reproductive physiology.",
        "prereqs": "BIOL 115 ; PHYS 2A , PHYS 2B ; CHEM 112A , CHEM 112B ; All courses with a C or better. Must be a declared Biology Major (all).",
        "coreqs": "BIOL 125 highly recommended.",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 125 - Systems Physiology Laboratory",
        "units": "2 unit(s)",
        "description": "Selected lab units to demonstrate complex physiological mechanisms and the physiology of organ systems. Methods include animal experiments and physiological recording and stimulation. Lab 6 hours.",
        "prereqs": "Must be a declared Biology Major (all).Pre/",
        "coreqs": "BIOL 124 (with grade of C- or better), or instructor consent.",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 129 - Neuroscience",
        "units": "3 unit(s)",
        "description": "Principles of brain organization and function underlying behavior. Topics include neuroanatomy and physiology of language, vision, sexual behavior, memory and abnormal behavior.",
        "prereqs": "Either PSYC 30 and 3 units of biology, or 9 units of biology.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Not acceptable as an elective in the Biology major. Cross-listed with PSYC 129 . Psychology is responsible for scheduling."
    },
    {
        "title": "BIOL 131 - Endocrine Physiology",
        "units": "3 unit(s)",
        "description": "Emphasis on mammalian systems. Mechanisms of hormone action, secretion and physiological effects; hormone assay techniques.",
        "prereqs": "BIOL 124 (with grade of C- or better), or instructor consent. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 134 - Vertebrate Histology",
        "units": "4 unit(s)",
        "description": "Light and electron microscopic structure of vertebrate tissues with consideration of related functions. Emphasis on the examination of human tissues including corresponding pathology. Lecture 2 hours/Lab 6 hours.",
        "prereqs": "BIOL 124 (with grade of C- or better), or instructor consent. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 135A - Eukaryotic Cell and Molecular Biology I",
        "units": "3 unit(s)",
        "description": "First semester of a year-long cell and molecular biology course. Topics include membrane structure, signal transduction, cytoskeletal structure, cell migration, and gene expression.",
        "prereqs": "BIOL 115 , CHEM 112A , CHEM 112B , and CHEM 135 (with a grade of C or better in each). Must be a declared Biology major.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 135B - Eukaryotic Cell and Molecular Biology II",
        "units": "3 unit(s)",
        "description": "BIOL 135B is the second semester of a year-long cell and molecular biology course. Topics covered include chromosome structure and maintenance, stem cell biology, cell death, and cancer biology. Satisfies SJSU Studies R: Earth, Environment, and Sustainability.",
        "prereqs": "BIOL 115 ; BIOL 135A ; BIOL 100W (with a grade of C or better in each). Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 135L - Molecular Cell Biology Lab",
        "units": "3 unit(s)",
        "description": "Lab experience in nucleic acid and protein purification, enzyme assay, bacterial and mammalian cell culture, immunofluorescence, column chromatography, agarose and polyacrylamide gel electrophoresis, spectrophotometry, light microscopy, etc. Lecture 1 hour/Lab 6 hours.",
        "prereqs": "BIOL 135A (with grade of C or better), or instructor consent. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 136 - Vertebrate Neurophysiology",
        "units": "3 unit(s)",
        "description": "Review of topics from the molecular to the organismal level. Chemical and electrotonic phenomena of membranes, neurochemistry, sensory transduction, information coding, neural control, and additional rotating topics.",
        "prereqs": "BIOL 124 (with a grade of C- or better), or instructor consent. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 136L - Vertebrate Neurophysiology Laboratory",
        "units": "1 unit(s)",
        "description": "Course-based undergraduate research experience using electrophysiological techniques to study nervous system function. Topics include chemical and electrotonic phenomena of membranes, information coding, and additional rotating topics. Lab 3 hours.",
        "prereqs": "BIOL 124 with a C- or better.",
        "coreqs": "BIOL 136 . Must be a declared Biology Major (all).",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 137 - Introduction to Principles of Toxicology",
        "units": "3 unit(s)",
        "description": "Emphasis on basic principles of toxicology. Toxicity of several classes of compounds covered in depth. Focus on basic chemical principles and appropriate applications. Course is repeatable for up to 3 units.",
        "prereqs": "BIOL 124 ; CHEM 112B (all with a grade of C- or better). Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Sustainability Related - SDG 3: Good Health and Well-Being",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 138 - Stem Cell Biology",
        "units": "3 unit(s)",
        "description": "Topics in the growing field of stem cell biology. Topics include: properties of embryonic and adult stem cells, use of stem cells in scientific research, regulation of stem cells, and invertebrate and vertebrate models of stem cell research.",
        "prereqs": "BIOL 115 with a C or better. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 139 - Cancer Biology",
        "units": "3 unit(s)",
        "description": "Basic principles of cancer biology needed to gain an overall understanding of cellular and molecular events that lead to the formation and progression of cancer. Topics include normal and abnormal cell behaviors, the steps leading to the development of malignancy, in-depth discussions of specific cancers, such as breast, colon, and myeoloid leukemias, and the development of diagnostic tools and therapies.",
        "prereqs": "BIOL 115 with a C or better, or instructor consent. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 140 - Human Sexuality",
        "units": "3 unit(s)",
        "description": "Biological and sociocultural facets of human sexuality. Evolution and physiology of sex, reproductive biology/ethics and cross-cultural expression of sexual behavior. Satisfies SJSU Studies S: Self, Society & Equality in U.S.",
        "prereqs": "Completion of Core General Education and upper division standing are prerequisites to all SJSU studies courses. Completion of, or co-registration in, 100W is strongly recommended.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Not acceptable as an elective in the Biology major. Cross-listed with ANTH 140 / PH 140 . Anthropology is responsible for scheduling."
    },
    {
        "title": "BIOL 142 - Paleontology",
        "units": "4 unit(s)",
        "description": "Study of the major groups of invertebrate and vertebrate fossils and their use in the study of geology, paleoecology, and macroevolution. Lecture 3 hours/lab 3 hours and field trips.",
        "prereqs": "GEOL 1 and GEOL 7 , or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Cross-listed with GEOL 142 . Geology is responsible for scheduling.",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 143 - Biogeography",
        "units": "3 unit(s)",
        "description": "Examination of the patterns of biodiversity over space and through time. Using data and models from a variety of sources including botany, zoology, ecology, evolutionary biology, paleontology, and geology, effects of isolation, elevation, and latitude are examined to understand spatial patterns of biodiversity.",
        "prereqs": "BIOL 31 or equivalent (with a grade of C- or better), or instructor consent. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Cross-listed with BOT 143 / ENT 143 / ZOOL 143 . Biological Sciences is responsible for scheduling. Sustainability Related",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 145 - Advanced Undergraduate Biology Seminar",
        "units": "1-3 unit(s)",
        "description": "Undergraduate Seminar in Biology. May be taken concurrently with BIOL 145L. Course is repeatable when content changes for up to 12 units.",
        "prereqs": "Completion of 9 units of upper division major coursework, or instructor consent. Must be a declared Biology Major.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 145L - Advanced Undergraduate Biology Lab",
        "units": "1-2 unit(s)",
        "description": "Advanced undergraduate laboratory or field experience. May be taken concurrently with BIOL 145. Course is repeatable for credit when content changes. 3 hours lab.Course is repeatable for up to 12 units.",
        "prereqs": "Completion of nine (9) units of upper division majors coursework. Instructor Consent. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 148 - Molecular Ecology",
        "units": "4 unit(s)",
        "description": "Applying molecular genetics approaches to ecological questions. Topics include: population genetics/genomics, landscape genetics/genomics, conservation genetics/genomics, non-invasive sampling, eDNA, etc. Lab section includes experience in modern molecular biology techniques. \n  Lecture 2 hours/Lab 6 hours.",
        "prereqs": "BIOL 118 or BIOL 115 with a grade of C or better is required. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 150 - Field Studies in Natural History",
        "units": "1-2 unit(s)",
        "description": "Field courses given on site, typically covering general ecology, botany, geology, zoology and specialized natural areas such as Baja California, Death Valley, seacoasts and mountains. Repeatable for up to a total of 3 units of credit when location or content changes. Satisfies B3: Laboratory Science.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Not an elective in the department majors. Cross-listed with GEOL 150 . Biological Sciences is responsible for scheduling. Sustainability Related - SDG 15: Life on Land"
    },
    {
        "title": "BIOL 155 - Hypothesis Testing",
        "units": "3 unit(s)",
        "description": "Experimental design and statistical analysis of biological data from manipulative experiments. Experience in designing and analyzing experiments using t-tests, 1- and 2-way ANOVA, Randomized Block ANOVA, Nested ANOVA, Linear Regression and Tests of Independence. Lecture 2 hours/Lab 3 hours.",
        "prereqs": "BIOL 30 and BIOL 31  (with grade of C- or better), or instructor consent. Must be a declared Biology or Environmental Studies Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 156 - Ecological Sampling Design and Analyses",
        "units": "3 unit(s)",
        "description": "Sampling design and statistical analysis of biological patterns. In this course, students design and execute a field experiment (one required weekend field trip) that incorporates multivariate measurements. Students analyze the data with Log Linear analysis, Logistic Regression, Principal Components Analysis, Canonical Correlation and various Regression techniques. Lecture 2 hours/Lab 3 hours.",
        "prereqs": "BIOL 113 or (with a grade of C or better), or instructor consent. Must be a declared Biology or Environmental Studies or Business Majors.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 159 - Integrative Biology",
        "units": "3 unit(s)",
        "description": "Capstone course in the BA Biological Science degree. Critical reading of scientific literature, experimental design and scientific communication skills will be emphasized. Topics covered may vary for a given semester.  Satisfies SJSU Studies R: Earth, Environment, and Sustainability.",
        "prereqs": "Senior standing, completion of A3 , ENGL 1B , HUM 2B , or equivalent with a C- or better; BIOL 115 or BIOL 118 ; BIOL 55 or BIOL 155 , (all with grade of C or better). Allowed Declared Majors: BIOL majors only.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 160 - Ecology",
        "units": "4 unit(s)",
        "description": "Factors that influence the distribution and abundance of organisms; some aspects of applied ecology. Lecture 3 hours/Lab 3 hours.Satisfies SJSU Studies R: Earth, Environment, and Sustainability for Biology Majors only.",
        "prereqs": "BIOL 113 (with a grade of C or better); Allowed Declared Majors (Biology, Natural Science); Completion of Core General Education and upper division standing are prerequisites to all SJSU studies courses. Completion of, or co-registration in, 100W is strongly recommended.Pre/",
        "coreqs": "BIOL 55 or BIOL 155 or BIOL 156 or equivalent Biostatistics course, or instructor consent.",
        "grading_type": "Letter Graded",
        "note": "All of SJSU Studies courses require completion of the WST and upper division standing. Cross-listed with BOT 160 . Biological Sciences is responsible for scheduling. Sustainability Focused"
    },
    {
        "title": "BIOL 161 - Marine Ecology and Biology",
        "units": "4 unit(s)",
        "description": "Introduction to the major ecological processes that determine the structure and diversity of species assemblages in marine and estuarine environments through field-oriented activities. Lecture 2 hours/Lab 6 hours.",
        "prereqs": "BIOL 55 /BIOL 155 or BIOL 156 , BIOL 115 or BIOL 118 ; must be a declared Biology Major (all); or instructor consent.Pre/",
        "coreqs": "BIOL 160 or instructor consent.",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 162 - Introduction to Biological Oceanography",
        "units": "4 unit(s)",
        "description": "Introduction to the major physical, chemical, ecological, and biological processes, including human influences, that govern life in marine environments. Lecture 2 hours, Lab 6 hours.",
        "prereqs": "BIOL 55 /BIOL 155 or BIOL 156 , and BIOL 115 or BIOL 118 ; all with a grade of C or better. Must be a Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 163 - Conservation Biology",
        "units": "3 unit(s)",
        "description": "Principles of conservation biology, including management for the preservation of biodiversity and maintenance of viable populations. Examples from plants and animals",
        "prereqs": "BIOL 113 (with grade of C or better), or instructor consent. Must be a declared major in Biological Sciences.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Sustainability Focused - SDG 15: Life on Land",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 164 - Ecological Field Methods",
        "units": "3 unit(s)",
        "description": "Techniques for evaluating and managing the abundance and diversity of plants and animals. Lecture 1 hour/Lab 6 hours.",
        "prereqs": "BIOL 113 or (with a grade of C or better), or instructor consent. Must be a declared major in Biological Sciences.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Sustainability Focused - SDG 15: Life on Land",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 165 - Advanced Human Anatomy",
        "units": "4 unit(s)",
        "description": "Study of human anatomy, including clinical correlations, for pre-professional students. Not open to student who have completed BIOL 065. Lecture 2 hours/Lab 6 hours.",
        "prereqs": "BIOL 30 and BIOL 31  (with a grade of C- or better in each), BIOL 115 (with a grade of C or better), or instructor consent. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 167 - Cardiorespiratory Physiology",
        "units": "3 unit(s)",
        "description": "Covers the normal anatomy and physiology of the cardiovascular and respiratory systems, as well as how they function following perturbations in homeostasis. Focuses on the mammalian system with some discussion of comparative physiology.",
        "prereqs": "BIOL 124 (with a grade of C- or better), or instructor consent. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 168 - Reproductive Physiology",
        "units": "3 unit(s)",
        "description": "Reproductive Physiology covers the anatomy and physiology of the reproductive system, as well as how deviations from the norm affect reproduction. Course focuses on the mammalian system with discussion of comparative physiology.",
        "prereqs": "BIOL 124 (with a grade of C- or better), or instructor consent. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 170 - Cellular and Molecular Physiology",
        "units": "3 unit(s)",
        "description": "Introduction to the structure and physiological function of cells. Topics include synthesis of cellular macromolecules such as DNA, RNA and proteins; internal cellular organization; biochemical reactions necessary for cell growth, death and cellular communication. Relevant pathophysiology examples of cellular dysfunction are presented.",
        "prereqs": "BIOL 124 (with a grade of C- or better), or instructor consent. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 177 - Physiology for Engineers",
        "units": "3 unit(s)",
        "description": "Structure and function of physiological systems and discussion of topics of particular importance to the design, development, construction and clinical application of biomedical devices. Practical laboratory application of technologies to monitor, repair, replace or augment physiological systems. Lecture 2 hours/Lab 3 hours.",
        "prereqs": "BIOL 30 , CHEM 1B , PHYS 50",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Cross-listed with BME 177 . Biomedical Engineering is responsible for scheduling.",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 178 - Integrative Physiology",
        "units": "3 unit(s)",
        "description": "Integrative Physiology is the capstone course in the Systems Physiology concentration. The specific physiology topics covered may vary depending on the semester. Critical reading of scientific literature, experimental design and scientific communication skills will be emphasized.  Satisfies SJSU Studies R: Earth, Environment, and Sustainability for Biology Majors only.",
        "prereqs": "BIOL 100W and BIOL 115 (with a grade of C or better); BIOL 124 (with a grade of C- or better); at least one upper division systems physiology elective; completion of Core General Education and upper division standing are prerequisites to all SJSU studies courses. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 180 - Individual Studies",
        "units": "1-4 unit(s)",
        "description": "Undergraduate advanced lab or field work in special fields. Repeatable for credit.",
        "prereqs": "Instructor consent. Must be a declared Biology Major (all). Not available to Open University Students.",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 181 - Introduction to Health Care",
        "units": "1-3 unit(s)",
        "description": "Participation and observation with a medical doctor, dentist, optometrist, pharmacist, or veterinarian in private practice, hospital or retail setting.",
        "prereqs": "Instructor consent. Must be a declared Biology Major (all). Not available to Open University Students.",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "Hepatitis B or other vaccinations may be required in some settings."
    },
    {
        "title": "BIOL 182 - Tutor Assistant in Biology",
        "units": "1-2 unit(s)",
        "description": "Supervised classroom or field experience as a tutor-assistant in experiments, demonstrations and discussion. Course may be repeated for credit. Repeatable for credit.",
        "prereqs": "Sophomore or Upper division standing, instructor consent and appropriate academic background. Not available to Open University Students. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 184 - Directed Reading",
        "units": "1-4 unit(s)",
        "description": "Assigned readings of selected books, journals and papers chosen to fill gaps in training or for contact with new fields. Evaluation through weekly reports and conferences. Repeatable for credit.",
        "prereqs": "Instructor consent. Not available to Open University Students. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 186 - Senior Thesis",
        "units": "2-4 unit(s)",
        "description": "Advanced library, laboratory or field research under the supervision of a faculty member, culminating in a senior thesis.",
        "prereqs": "Instructor consent. Not available to Open University Students. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 190 - Field Studies in Biology",
        "units": "1-4 unit(s)",
        "description": "Field program involving planning and execution of a project. Course is repeatable for a maximum of 12 units. Course is repeatable for up to 12 units.",
        "prereqs": "Instructor consent. Not available to Open University Students. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit Sustainability Related - SDG 15: Life on Land",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 198 - Undergraduate Research",
        "units": "5-4 unit(s)",
        "description": "Field or laboratory biological research under the direction of a faculty member. Course is repeatable for up to 8 units.",
        "prereqs": "Instructor consent. Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 201 - Graduate Seminar in Biological Sciences",
        "units": "1 unit(s)",
        "description": "Seminar designed to introduce principles and topics in biological research. Mandatory during first semester of enrollment.  Course may be repeated for credit for up to 4 units.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 202 - Graduate Studies in Biology",
        "units": "3 unit(s)",
        "description": "A seminar on current research and theory in the life sciences, emphasizing scientific writing and formal oral presentations. Lecture/seminar/discussion 5 hours.Satisfies GWAR: Graduation Writing Assessment Requirement.",
        "prereqs": "Instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "This course satisfies graduate-level GWAR in this masters program."
    },
    {
        "title": "BIOL 202TA - Biotech Seminar: Biotech Products",
        "units": "3 unit(s)",
        "description": "Seminar course in which students develop professional skills in writing, speaking, literature review, and critical thinking. Assignments are targeted at developing expertise and knowledge useful in the biotechnology industry. Focuses on biotechnology products. Satisfies GWAR: Graduation Writing Assessment Requirement.",
        "prereqs": "Enrollment in the Master of Biotechnology Program.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "This course satisfies graduate-level GWAR in this masters program."
    },
    {
        "title": "BIOL 202TB - Biotech Seminar: Drug Development Process",
        "units": "3 unit(s)",
        "description": "Seminar course in which students develop their professional skills. Assignments are targeted at developing expertise and knowledge useful in the biotechnology industry. Focuses on the development of drugs and other biotechnology products. Satisfies GWAR: Graduation Writing Assessment Requirement.",
        "prereqs": "Enrollment in the Master of Biotechnology Program.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "This course satisfies graduate-level GWAR in this masters program."
    },
    {
        "title": "BIOL 202TC - Biotech Seminar: Biotech Business I",
        "units": "2 unit(s)",
        "description": "BIOL 202TC is a seminar course in which students develop their professional skills. Assignments are targeted at developing expertise and knowledge useful in the biotechnology and pharmaceutical industries. BIOL 202TC focuses on the financial aspects of business development in biotechnology.",
        "prereqs": "Enrollment in the Master of Biotechnology Program.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 202TD - Biotech Seminar: Biotech Business II",
        "units": "2 unit(s)",
        "description": "Seminar course in which students develop their professional skills. Assignments target developing expertise and knowledge useful in the biotechnology and pharmaceutical industries. Focuses on business development in biotechnology and a team project in which students develop a business plan.",
        "prereqs": "BIOL 202TC or instructor consent",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 203 - Biology Teaching Forum",
        "units": "3 unit(s)",
        "description": "Introduction to effective methods for teaching undergraduate biology laboratories, activities, seminars and/or lectures. Emphasis on pedagogy and application of best practices and strategies for teaching biology to a diverse audience. Course administration, student conduct and expectations, and assessment will also be covered.",
        "prereqs": "graduate standing or instructor consent",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 205 - Advanced Molecular Techniques",
        "units": "4 unit(s)",
        "description": "Emphasizes the laboratory techniques of modern molecular biology. Depending on instructor, focus will be on animal, plant, yeast, bacterial or viral systems. Course is repeatable for credit if content changes. Misc/Lab: Lecture 2 hours/lab 6 hours.",
        "prereqs": "BIOL 135L or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 205T - Advanced Molecular Techniques for Biotechnology",
        "units": "4 unit(s)",
        "description": "Emphasizes the laboratory techniques of modern molecular biology especially: report writing and communication of research results. Depending on instructor, focus will be on animal, plant, yeast, bacterial, or viral systems. Misc/Lab: Lecture 2 hours/lab 6 hours.",
        "prereqs": "BIOL 135L and admission into the Master of Biotechnology program.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 215 - Seminar in Advanced Genetics",
        "units": "3 unit(s)",
        "description": "Selected topics of current interest in advanced genetics. Each semester will emphasize a particular field of genetics; e.g., molecular genetics, human genetics, developmental genetics, population genetics, etc.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 218 - Advanced Evolution",
        "units": "3 unit(s)",
        "description": "Integrated use of modern molecular techniques and classical evolutionary theory to address a broad array of questions in evolutionary biology.",
        "prereqs": "BIOL 115 and instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 220 - Science Communication",
        "units": "3 unit(s)",
        "description": "This course will focus on learning to effectively present ongoing scientific research to a wide audience, with an emphasis on developing science communication skills, learning to place data within the context of a field, and developing critical thinking skills. Pre/",
        "prereqs": "No prerequisites",
        "coreqs": "BIOL 202",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 221T - Advanced Bioinformatics for Biotechnology",
        "units": "4 unit(s)",
        "description": "Bioinformatics/computer applications to solve advanced problems in molecular and cell biology by manipulation and analysis of DNA, RNA, and protein sequences.",
        "prereqs": "BIOL 116 or either CHEM 130A , CHEM 135 , or Chem 136 and admission into the Master of Biotechnology program.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 227 - Advanced Physiology",
        "units": "3 unit(s)",
        "description": "Integrated discussion of modern physiological techniques to address a broad array of questions in physiology. Each semester will emphasize a particular field of physiology.",
        "prereqs": "Graduate standing and completion of an upper division physiology course or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 227T - Principles of Pharmacology",
        "units": "3 unit(s)",
        "description": "Principles of pharmacology, especially as related to the pharmaceutical industry and clinical applications.",
        "prereqs": "BIOL 30 or equivalent; Physiology recommended",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 229T - Biotechnology Instrumentation",
        "units": "3 unit(s)",
        "description": "Introduction to the principles of operation of common instruments used in the biotechnology and pharmaceutical industries. Includes understanding and experience with calibration, detection mechanisms, data output, trouble-shooting and decision making process. Misc/Lab: Lecture 2 hours / Lab 3 hours.",
        "prereqs": "Enrollment in the Master of Biotechnology program.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 230 - Comparative Animal Physiology",
        "units": "3 unit(s)",
        "description": "A seminar in the functional relationships of invertebrates and vertebrates. Evolutionary patterns and environmental adaptations are considered.",
        "prereqs": "An upper division course in physiology or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 233 - Immunological Techniques",
        "units": "3 unit(s)",
        "description": "Principles, concepts and mechanisms relative to serological and other immunological procedures and reactions with emphasis on practical applications. Misc/Lab: Lab 9 hours.",
        "prereqs": "Upper division microbiology or cell biology, or organic chemistry and instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 233T - Immunological Techniques for Biotechnology",
        "units": "3 unit(s)",
        "description": "Principles, concepts, and mechanisms relative to serological and other immunological procedures and reactions with emphasis on applications in the biotechnology industry.",
        "prereqs": "Immunology laboratory (grade Bor better) or equivalent experience and admission to the Master of Biotechnology program.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 242 - Advanced Paleontology",
        "units": "4 unit(s)",
        "description": "The lecture portion of this course will be conducted as a seminar; students will read and discuss classic and important newer papers on macroevolutionary theory and paleobiology. In the lab portion of this course, students will use fossil samples to develop and test scientific hypotheses that will be part of a semester-long project. Misc/Lab: Lecture 4 hours/Lab 3 hours.",
        "prereqs": "Suitable background in geology or evolutionary biology.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Cross-listed with GEOL 242 . Geology is responsible for scheduling.",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 255E - Advanced Topics: Ecology and Evolution",
        "units": "1-4 unit(s)",
        "description": "Advanced Topics: Ecology and Evolution is a rotating topics course; each offering will have different content. The purpose of the seminar is to help students develop a deeper understanding of specific aspects of ecology and evolution through thorough examination of primary scientific literature, discussion and presentations. Enrollment in at least 3 units of BIOL 255E is mandatory for the MS Biological Sciences: concentration in Ecology and Evolution program. Course may be repeated for credit for up to 16 units.",
        "prereqs": "Graduate standing or Instructor consent",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Sustainability Focused - SDG 15: Life on Land",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 255L - Advanced Biology Laboratory",
        "units": "1-4 unit(s)",
        "description": "Laboratory or field experience in advanced biology. Course is repeatable for credit when content changes. Course may be repeated for credit for up to 6 units.",
        "prereqs": "Instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "May be taken concurrent with any 255 seminar."
    },
    {
        "title": "BIOL 255M - Advanced Topics:Molecular & Microbiology",
        "units": "1-4 unit(s)",
        "description": "Advanced study in molecular and microbiology. Course is repeatable for credit when content changes. Course may be repeated for credit for up to 16 units.",
        "prereqs": "Instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 255P - Seminar in Advanced Biology: Physiology",
        "units": "1-4 unit(s)",
        "description": "Advanced study in plant or animal physiology. Course is repeatable for credit when content changes. Course may be repeated for credit for up to 16 units.",
        "prereqs": "graduate standing or instructor consent",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 255T - Introduction to Stem Cell Techniques",
        "units": "4 unit(s)",
        "description": "This laboratory/lecture course exposes students to the theoretical and practical aspects of contemporary stem cell techniques. Students will culture mouse embryonic stem cells on feeders and characterize them using immunofluorescence and flow cytometry, differentiate various lineages and observe genetic modifications. Students will prepare inducible pluripotent stem cells (iPS) from primary cells. This includes both the theoretical and practical aspects of applied stem cell in regenerative approaches as well as models of disease for research purposes. Students are expected to keep a laboratory notebook and document their experiments and results. Additionally, students will present scientific papers on recent topics in stem cell basic research, as published in scientific journals of recent year. The goal of this course will be to provide students with basic experience in methods used in stem cell laboratories, so that they can transition to an internship in a stem cell laboratory (although many of these techniques are applicable in a number of diverse fields), and to provide students with the most current stem cell topics while practicing effective presentation and evaluation skills.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 256 - Advanced Experimental Design and Analysis",
        "units": "3 unit(s)",
        "description": "Provides training in advanced statistical procedures and experimental designs for graduate-level research. The content is tailored to research needs of enrolled students. Includes sampling schemes, randomization analyses, complex ANOVA and multivariate analyses.",
        "prereqs": "Upper division statistics course; graduate standing.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 280 - Masters Individual Studies",
        "units": "1-3 unit(s)",
        "description": "Graduate level research projects designed in conjunction with faculty advisor. Course is repeatable for up to 6 units.",
        "prereqs": "Graduate standing and instructor consent. Not available to Open University Students.",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 280T - Internship in the Biotechnology Industry",
        "units": "2 unit(s)",
        "description": "A 8-10 week internship at a Bay Area biotechnology company in R&D, quality control, manufacturing, human resources, marketing, or sales. Course may be repeated for credit for up to 6 units.",
        "prereqs": "Admission to the Master of Biotechnology program.",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 281T - Individual Studies in Biotechnology",
        "units": "1-4 unit(s)",
        "description": "Supervised, advanced work in specialized fields relevant to biotechnology.",
        "prereqs": "Admission to the Master of Biotechnology program; instructor consent and Program Director.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 282C - Biotechnology Company Management",
        "units": "3 unit(s)",
        "description": "Provides general management perspectives of biotechnological innovation; focuses on challenges of managing the development of new technologies, products, and processes in biotech sectors; examines management concepts, industry practices, and cases relevant to the biotechnology sector.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 283T - Topics in Biotech Regulatory Affairs",
        "units": "3 unit(s)",
        "description": "Introduction to laws regulating the pharmaceutical, biotechnology, medical device industries. Discussions of company organization; product development and commercialization; Good Manufacturing Practice. Lecture 2 hours/Activity 2 hours.",
        "prereqs": "Admission to the Master of Biotechnology program and consent of the Program Director.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 284 - Masters Directed Reading",
        "units": "1-3 unit(s)",
        "description": "Directed reading and discussion of biological literature and/or individualized preparation for culminating graduate experience. Not available to Open University Students.",
        "prereqs": "Graduate Standing in MA program; instructor consentPre/",
        "coreqs": "Graduate standing in MA program and instructor consent.",
        "grading_type": "Mandatory Credit/No Credit/RP",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 285 - Colloquium in Biological Sciences",
        "units": "1 unit(s)",
        "description": "Meetings for the presentation and discussion of advanced studies in special fields including original work by the faculty, guest investigators and graduate students. Topics will vary from year to year.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 285T - Colloquium in Biotechnology",
        "units": "1 unit(s)",
        "description": "Meetings for reporting, by written and oral presentations, progress through the MBT program.",
        "prereqs": "Admission to the Master of Biotechnology program.",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 291A - Introduction to Molecular Diagnostics I",
        "units": "3 unit(s)",
        "description": "Graduate level course which will include topics relevant to all tests and methods used to identify a disease or the predisposition for a disease through DNA, RNA, or protein analysis. Methods for isolation from human clinical samples.",
        "prereqs": "Instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 291B - Introduction to Molecular Diagnostics II: Human Genetic Diseases and Detection",
        "units": "3 unit(s)",
        "description": "Graduate level course which will include topics relevant to all tests and methods used to identify a disease or the predisposition for a disease through DNA or RNA analysis of human samples.",
        "prereqs": "BIOL 291A or Instructor Consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 297 - Graduate Research",
        "units": "1-4 unit(s)",
        "description": "Advanced graduate lab or field research projects designed in conjunction with faculty advisor. Repeatable for credit, up to 10 units can be applied towards the degree. Course is repeatable for up to 10 units.",
        "prereqs": "Graduate Standing and Instructor Consent.",
        "coreqs": "No corequisites",
        "grading_type": "Mandatory Credit/No Credit/RP",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 298 - MS Project Culminating Experience",
        "units": "1 unit(s)",
        "description": "Culminating experience for MS Project Option, consisting of the development of a manuscript describing students research and following journal guidelines for manuscript preparation, followed by a public seminar defending the research project. Course may be repeated for credit for up to 2 units.",
        "prereqs": "Advancement to candidacy for the Master of Science degree",
        "coreqs": "No corequisites",
        "grading_type": "Mandatory Credit/No Credit/RP",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 298M - MA Culminating Experience",
        "units": "1 unit(s)",
        "description": "Advanced individual work toward program Plan B (Comprehensive Exam or Masters Project). Course may be repeated for credit for up to 4 units.",
        "prereqs": "Advancement to candidacy for the MA in Biological Sciences and graduate advisor approval.",
        "coreqs": "No corequisites",
        "grading_type": "Mandatory Credit/No Credit/RP",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 299 - Masters Thesis",
        "units": "1-4 unit(s)",
        "description": "Culminating experience for MS Thesis Option, consisting of the development of a thesis describing the students research, followed by a public seminar defending the research project.",
        "prereqs": "Advancement to candidacy for the Master of Science degree. Must be a declared Biology Major. Not available to Open University Students.",
        "coreqs": "No corequisites",
        "grading_type": "Mandatory Credit/No Credit/RP",
        "note": "No additional notes"
    },
    {
        "title": "BIOL 1290R - Culminating Experience Supervision",
        "units": "1 unit(s)",
        "description": "This course covers the same topics and has the same objectives as BIOL 298 /BIOL 298M /BIOL 299 . Course is repeatable for up to 16 units.",
        "prereqs": "Must have received an RP in BIOL 298 /BIOL 298M /BIOL 299 . Must be a declared Biology Major (all).",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit/No Degree Credit",
        "note": "No Degree Credit."
    },
    {
        "title": "CHEM 1A - General Chemistry",
        "units": "5 unit(s)",
        "description": "Topics including stoichiometry, reactions, atomic structure, periodicity, bonding, states of matter, energy changes, solutions using organic and inorganic examples. Lab program complements lecture. Misc/Lab: Lecture 3 hours/lecture 1 hour/lab 3 hours.Satisfies B1 + B3: Physical + Lab Science.",
        "prereqs": "Proficiency in high school chemistry or CHEM 10 (with a grade of C or better; C- not accepted) or instructor consent; proficiency in high school algebra and eligibility for MATH 19 ; Writing Enrollment Group W-I or W-II, or ENGL 1AF with a grade of CR, or ENGL 1A with a grade of C- or better.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 1B - General Chemistry",
        "units": "5 unit(s)",
        "description": "Topics including stoichiometry, colligative properties, kinetics, equilibria, thermodynamics and electrochemistry. Lab program complements lecture. Lecture 3 hours, lab/activity 5.5 hours.Satisfies B1: Physical Science + B3: Laboratory.",
        "prereqs": "CHEM 1A (with a grade of C or better; C- not accepted).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 2 - Academic Excellence Workshop",
        "units": "1-2 unit(s)",
        "description": "Cooperative learning activity to accompany selected College of Science courses and sections. Activity 4 hours.",
        "prereqs": "No prerequisites",
        "coreqs": "Enrollment in course and section accompanying workshop.",
        "grading_type": "Credit/No Credit",
        "note": "No credit toward requirements for any science major or minor. May be used for university electives."
    },
    {
        "title": "CHEM 8 - Organic Chemistry",
        "units": "3 unit(s)",
        "description": "Introduction to the chemistry of carbon compounds for allied health majors and others requiring only 3 units of organic chemistry lecture.",
        "prereqs": "CHEM 1B (with a grade of C or better; C- not accepted).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "CHEM 8 is not a satisfactory prerequisite for CHEM 112B . No credit toward Chemistry major or minor."
    },
    {
        "title": "CHEM 9 - Organic Chemistry Lab",
        "units": "1 unit(s)",
        "description": "Organic chemistry laboratory for allied health majors and others requiring only 1 unit of organic chemistry lab. Lab 3 hours.Pre/",
        "prereqs": "No prerequisites",
        "coreqs": "CHEM 8 .",
        "grading_type": "Letter Graded",
        "note": "No credit toward Chemistry major or minor."
    },
    {
        "title": "CHEM 10 - Chemical Calculations and Concepts",
        "units": "3 unit(s)",
        "description": "Fundamental concepts in chemistry and problems in chemical symbolism and calculations. For students wishing to continue in chemistry, but lacking prerequisites for CHEM 1A . Misc/Lab: Lecture 2 hours/activity 2 hours.",
        "prereqs": "One year high school algebra.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No credit towards chemistry major or minor."
    },
    {
        "title": "CHEM 30A - Introductory Chemistry",
        "units": "3 unit(s)",
        "description": "The physical world as seen by a chemist; the ways this world affects humans, other animals and plants used as illustrations of fundamental general chemistry. Misc/Lab: Lecture 2 hours/lab 3 hours.Satisfies B1 + B3: Physical + Lab Science.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No credit toward Chemistry major or minor."
    },
    {
        "title": "CHEM 30B - Introductory Chemistry",
        "units": "3 unit(s)",
        "description": "Organic compounds produced both in nature and artificially and the reactions they undergo, particularly in the human. Lecture 2 hours/lab 3 hours.",
        "prereqs": "CHEM 30A or CHEM 1A (with a grade of C or better; C- not accepted).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No credit toward Chemistry major or minor."
    },
    {
        "title": "CHEM 55 - Quantitative Analysis",
        "units": "2 unit(s)",
        "description": "Introduction to theories and techniques of chemical analysis.",
        "prereqs": "CHEM 1B (with a grade of C or better; C- not accepted)",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 55L - Quantitative Analysis Laboratory",
        "units": "2 unit(s)",
        "description": "Introduction to chemical analysis techniques. Lab 6 hours.Pre/",
        "prereqs": "No prerequisites",
        "coreqs": "CHEM 55 .",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 92 - International Program Studies",
        "units": "1-6 unit(s)",
        "description": "Study Abroad and Away transfer credit course. Study Abroad and Away provides students the opportunity to study abroad on long term programs (Exchange Programs, CSU International Programs, and International Student Exchange Programs) and short-term programs (Faculty-Led Programs and Summer School Abroad Programs) for academic credit, offering Alternative Break Programs for cultural immersion, and designing other globally focused opportunities. This course is designated as a placeholder course for Study Abroad and Away programs.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Mixed Grading",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 100W - Writing Workshop: Chemical Communications",
        "units": "3 unit(s)",
        "description": "Improvement of skills in scientific writing and speaking. Satisfies Writing in the Disciplines (WID).",
        "prereqs": "CHEM 55 or CHEM 112A (with grades of C or better; C- not accepted). A3 or equivalent second semester composition course (with a grade of C- or better); completion of core GE; and upper division standing. Allowed Declared Majors: Chemistry, Biochemistry. Or Graduate or Postbaccalaureate level.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Must be passed with C or better to satisfy the CSU Graduation Writing Assessment Requirement (GWAR)."
    },
    {
        "title": "CHEM 101 - Chemistry and the Computer",
        "units": "3 unit(s)",
        "description": "Computational methods for analyzing and storing chemical data sourced from both experiments and molecular simulations. Emphasis on the use of Excel and Python; no previous coding experience needed. Lecture 2 hours/activity 2 hours.",
        "prereqs": "CHEM 55 and MATH 30 or MATH 30P or MATH 30PL or MATH 30X (with a grade of C or better; C- not accepted).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Offered online."
    },
    {
        "title": "CHEM 112A - Organic Chemistry",
        "units": "3 unit(s)",
        "description": "Chemistry of the carbon compounds, both aliphatic and aromatic, emphasizing underlying concepts.",
        "prereqs": "CHEM 1B (with a grade of C or better; C- not accepted).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 112B - Organic Chemistry",
        "units": "3 unit(s)",
        "description": "Continuation of CHEM 112A .",
        "prereqs": "CHEM 112A (with a grade of C or better; C- not accepted).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 113A - Organic Chemistry Lab",
        "units": "2 unit(s)",
        "description": "Fundamental techniques for the isolation, characterization and synthesis of organic compounds. Misc/Lab: Lab 6 hours.",
        "prereqs": "CHEM 112A (with a grade of C or better; C- not accepted). Chemistry, Biology, Forensic Science-Chemistry, Forensic Science-Biology, Biomedical Engineering and Chemical Engineering majors only, all others by department consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 113B - Organic Chemistry Lab",
        "units": "3 unit(s)",
        "description": "Continuation of CHEM 113A including more advanced work. Lecture 1 hour/lab 6 hours.",
        "prereqs": "CHEM 113A (with a grade of C or better; C- not accepted). Chemistry majors only or instructor consent.Pre/",
        "coreqs": "CHEM 112B .",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 114 - Advanced Organic Chemistry Lab",
        "units": "3 unit(s)",
        "description": "A capstone course on special topics in laboratory experiments utilizing modern chemical, physical and spectrometric methods. A grade of C or better is required for majors. Lecture 1 hour/lab 6 hours.",
        "prereqs": "CHEM 55 , CHEM 100W , CHEM 112B and CHEM 113B (with grades of C or better; C- not accepted).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 118 - Special Topics in Organic Chemistry",
        "units": "1 unit(s)",
        "description": "Introduction to a wide range of subjects typically missing from the traditional organic chemistry sequence (CHEM 112A and CHEM 112B , CHEM 113A , and CHEM 113B ). Consult schedule of classes for current offering(s). May be repeated for credit for up to 2 units.",
        "prereqs": "CHEM 112B (with a grade of C or better; C- not accepted).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 120S - Chemical Safety Seminar",
        "units": "1 unit(s)",
        "description": "Safety protocol appropriate to working with hazardous chemicals. Physical nature of hazards, biological effects, permissible exposures, safety precaution techniques. OSHA requirements.",
        "prereqs": "College level chemistry course. Upper division standing.",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 121S - Radiation Safety",
        "units": "1-2 unit(s)",
        "description": "Health hazards involved in working with radioactive substances. Physical nature of hazards, biological effects, standards of permissible exposures, safety precautions and protection techniques. Two units meet State of California recommendations.",
        "prereqs": "Lower division calculus, chemistry and physics.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Cross-listed with NUCS 121S / PHYS 121S . Chemistry is responsible for scheduling.",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 126 - Introduction to Nuclear Science",
        "units": "3 unit(s)",
        "description": "Properties of the atomic nucleus. Applications of nuclear science in biology, chemistry, engineering, geology and physics.",
        "prereqs": "Lower division calculus, chemistry and physics.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Cross-listed with NUCS 126 / PHYS 126 . Chemistry is responsible for scheduling.",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 127 - Nuclear Science Lab",
        "units": "3 unit(s)",
        "description": "Basic techniques and procedures used in nuclear science. Nuclear decay, nuclear reactions, radiation detection and measurements, nuclear analytical methods, and tracer techniques. Lecture 1 hour/lab 6 hours.",
        "prereqs": "NUCS 121S , CHEM 100W , and CHEM 126 (with grades of C or better; C- not accepted); or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "ABC-/No Credit Cross-listed with NUCS 127 / PHYS 127 . Chemistry is responsible for scheduling.",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 130A - Biochemistry",
        "units": "4 unit(s)",
        "description": "Chemistry of amino acids, carbohydrates, lipids, and nucleotides. Studies of protein structure and function, protein isolation, enzyme kinetics, and enzyme mechanisms.",
        "prereqs": "CHEM 112B (with grade of C or better; C- not accepted).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "CHEM 130A and CHEM 135 cannot both be applied towards a Chemistry major or a Chemistry minor."
    },
    {
        "title": "CHEM 130B - Biochemistry",
        "units": "4 unit(s)",
        "description": "Continuation of CHEM 130A . Concepts of bioenergetics; biochemical pathways of degradation and synthesis; metabolic regulation.",
        "prereqs": "CHEM 130A and BIOL 30 (with grades of C or better; C- not accepted).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 130C - Biochemistry",
        "units": "3 unit(s)",
        "description": "Advanced biochemical topics selected from the fields of immunology, physiology, molecular and cell biology.",
        "prereqs": "CHEM 130A and BIOL 30 (with grades of C or better; C- not accepted).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 131A - Biochemistry Lab",
        "units": "2 unit(s)",
        "description": "Fundamental qualitative and quantitative techniques and methodology in modern biochemistry. Lab 6 hours.",
        "prereqs": "CHEM 55 and CHEM 113A (with a grade of C or better; C- not accepted).Pre/",
        "coreqs": "CHEM 130A .",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 131B - Biochemistry Lab",
        "units": "3 unit(s)",
        "description": "Second course of a two semester biochemistry laboratory sequence, with laboratory work associated with intermediate qualitative and quantitative techniques in modern biochemistry. It serves as a capstone course on advanced isolation techniques and enzyme methodology that requires students to integrate principles, theories, and methods learned in previous courses through a research project. Lecture 1 hour/lab 6 hours.Satisfies SJSU Studies R: Earth, Environment, and Sustainability.",
        "prereqs": "CHEM 100W , CHEM 130A , and CHEM 131A (with grades of C or better; C- not accepted).Pre/",
        "coreqs": "CHEM 130B or CHEM 130C .",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 132 - Introductory Biochemistry",
        "units": "4 unit(s)",
        "description": "Cellular and nutritional biochemistry for those who do not plan to continue in biochemistry, such as nutritional science and other science majors.",
        "prereqs": "CHEM 30B or CHEM 8 (with grades of C or better; C- not accepted).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No credit toward Chemistry major or minor."
    },
    {
        "title": "CHEM 132L - Introductory Biochemistry Lab",
        "units": "1 unit(s)",
        "description": "Lab work associated with chemistry of foods and nutrition, cellular metabolism, biomacromolecules, vitamins, and the structure of carbohydrates, lipids, proteins, and nucleic acids. Lab 3 hours.",
        "prereqs": "CHEM 30B or CHEM 8 (with a grade of C or better, C- not accepted).Pre/",
        "coreqs": "CHEM 132 .",
        "grading_type": "Letter Graded",
        "note": "No credit toward Chemistry major or minor."
    },
    {
        "title": "CHEM 135 - General Biochemistry",
        "units": "4 unit(s)",
        "description": "Survey course on structure/function of biological molecules such as amino acids, proteins including enzymes, lipids/membranes, carbohydrates, and nucleic acids. Course topics include intermediary metabolism, regulation, and molecular biology.",
        "prereqs": "BIOL 30 , CHEM 112A , CHEM 112B (with a grade of C or better; C- not accepted).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "CHEM 135 and CHEM 130A cannot both be applied toward a chemistry major or a chemistry minor."
    },
    {
        "title": "CHEM 145 - Inorganic Chemistry",
        "units": "3 unit(s)",
        "description": "Development of unifying principles to understand the chemistry of the elements. An introduction to the chemistry, bonding theories, and applications of coordination compounds.",
        "prereqs": "CHEM 112B (with grade of C or better; C- not accepted).",
        "coreqs": "CHEM 113A .",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 146 - Physical-Inorganic Techniques",
        "units": "3 unit(s)",
        "description": "Application of advanced instrumental and preparative techniques to the study of structure, reactivity, and spectroscopy of inorganic and organic substances including materials. This is a capstone course. A grade of C or better is required for majors. Lecture 1 hour/lab 6 hours.",
        "prereqs": "CHEM 100W , CHEM 113A , and CHEM 145 (with grades of C or better; C- not accepted) or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 155 - Instrumental Analysis",
        "units": "4 unit(s)",
        "description": "Principles and practices in the use of instrumental methods in chemical analysis. Basic physical chemistry necessary to understand the operation and limitations of the instruments. Lecture 3 hours/lab 3 hours.",
        "prereqs": "CHEM 55 , CHEM 55L , and CHEM 100W or JS 100W or ENGR 100W (with grades of C or better; C- not accepted).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded.",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 159 - Advanced Analytical Chemistry",
        "units": "1-2 unit(s)",
        "description": "A lecture and problem course which considers advanced topics in chemical analysis. Consult schedule of classes for current offering(s).",
        "prereqs": "Upper division standing or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "A total of 6 units may apply toward degree."
    },
    {
        "title": "CHEM 160 - Physical Chemistry",
        "units": "4 unit(s)",
        "description": "Introduction to the fundamental principles of physical chemistry. Thermodynamics, kinetics, quantum mechanics, and spectroscopy.",
        "prereqs": "CHEM 55 , PHYS 2B , and MATH 30 or MATH 30X (all with grades of C or better; C- not accepted).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 161A - Physical Chemistry",
        "units": "3 unit(s)",
        "description": "Principles of classical physical chemistry. Chemical thermodynamics, kinetics, and electrochemistry.",
        "prereqs": "CHEM 55 (or CHEM 1B and upper division standing for engineering majors), PHYS 50 , and MATH 32 or MATH 32X (all with grades of C or better; C- not accepted).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 161B - Physical Chemistry",
        "units": "3 unit(s)",
        "description": "Principles of modern physical chemistry. Quantum chemistry, spectroscopy, and statistical mechanics.",
        "prereqs": "CHEM 161A and PHYS 52 (with grades of C or better; C- not accepted). Upper division standing.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 162L - Physical Chemistry Lab",
        "units": "2 unit(s)",
        "description": "Physical chemical measurements with data analysis and written reports. Lab 6 hours.",
        "prereqs": "CHEM 100W or ENGR 100W ; CHEM 161A or CHEM 160 (all prerequisites with grades of C or better; C- not accepted).",
        "coreqs": "If using CHEM 161A as a prerequisite, either CHEM 161B or CHE 158 are required as a co-requisite.",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 170A - Macromolecular, Supramolecular & Nanoscale Systems",
        "units": "1 unit(s)",
        "description": "Introduction to macromolecular, supramolecular, and nanoscale systems and the principles that govern them including preparation, characterization, and physical properties, with an emphasis on applications of these materials in chemistry and beyond.",
        "prereqs": "CHEM 112B with grade of C or better (C- not accepted) or with instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 172 - Chemistry of Wine",
        "units": "1 unit(s)",
        "description": "Introduction to the chemistry of important components (organic acids, pigments, tannins, flavor constituents, etc.) of grape wine. Chemical changes that occur during fermentation, maturation, and aging.",
        "prereqs": "CHEM 1B (with a grade of C or better; C- not accepted) or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 180 - Individual Studies",
        "units": "1-4 unit(s)",
        "description": "Advanced supervised lab work. Work and results described in written and oral reports as required by the instructor. An honors course.",
        "prereqs": "Instructor consent. Not available to Open University Students.",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "Based on university policy, no more than 4 units of Individual Studies (180) and/or Directed Reading (184) may count for the baccalaureate degree, in total. For students in the Biochemistry Concentration, only 3 CR/NC units can count towards upper division electives. High Impact Practice: Undergraduate Research"
    },
    {
        "title": "CHEM 184 - Directed Reading",
        "units": "1-3 unit(s)",
        "description": "Assigned readings of selected books, journals and papers to fill gaps in training or for contact with new fields. Regular conferences with instructor. Written report required. An honors course.",
        "prereqs": "Instructor consent and CHEM 55 . Not available to Open University Students",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 190 - Introduction to Research",
        "units": "1 unit(s)",
        "description": "Supplemental course taken simultaneously with lower and upper division chemistry lecture courses. Foundational techniques for doing research. Preparation and active participation expected.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 191 - Undergraduate Seminar",
        "units": "5 unit(s)",
        "description": "Engaging with presentations of topics within specialized sub-areas of chemistry by SJSU Masters students, SJSU faculty, and faculty and other professionals in the chemistry enterprise beyond SJSU. A total of 2 units may be repeated. Course may be repeated for credit for up to 2 units.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 192 - International Program Studies",
        "units": "1-6 unit(s)",
        "description": "Study Abroad and Away transfer credit course. Study Abroad and Away provides students the opportunity to study abroad on long term programs (Exchange Programs, CSU International Programs, and International Student Exchange Programs) and short-term programs (Faculty-Led Programs and Summer School Abroad Programs) for academic credit, offering Alternative Break Programs for cultural immersion, and designing other globally focused opportunities. This course is designated as a placeholder course for Study Abroad and Away programs.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Mixed Grading",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 199 - Senior Thesis or Project",
        "units": "1 unit(s)",
        "description": "",
        "prereqs": "Minimum of 2 units of CHEM 180 or CHEM 184 , instructor consent and CHEM 100W . Not available to Open University Students",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 213 - Organic Synthesis",
        "units": "3 unit(s)",
        "description": "Synthetic methods and their application to multistep organic syntheses. Emphasis will be placed on synthetic strategy and a mechanistic understanding of synthetic reactions.",
        "prereqs": "CHEM 112B (or equivalent with a grade of C or better; C- not accepted). Alternate years 3 units.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 216 - Physical Organic Chemistry",
        "units": "3 unit(s)",
        "description": "Application of molecular orbital theory to organic chemistry and related topics.",
        "prereqs": "CHEM 112B and CHEM 161B (or equivalents with grades of C or better; C- not accepted).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Alternate years."
    },
    {
        "title": "CHEM 218 - Organotransition Metal Chemistry",
        "units": "3 unit(s)",
        "description": "Structure and reaction chemistry of compounds which contain transition metal-carbon bonds. Applications to catalytic processes and to organic synthesis.",
        "prereqs": "CHEM 112B and CHEM 145 (or equivalents with grades of C or better; C- not accepted) or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Alternate years."
    },
    {
        "title": "CHEM 231 - Advanced Biochemistry",
        "units": "3 unit(s)",
        "description": "Chemistry of the amino acids, peptides and proteins, the chemistry of enzyme action and introduction to the metabolism of amino acids and related compounds.",
        "prereqs": "CHEM 130B or CHEM 135 (or equivalent with a grade of C or better; C- not accepted).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Alternate years."
    },
    {
        "title": "CHEM 232 - Nucleic Acids",
        "units": "3 unit(s)",
        "description": "Topics include structural features of DNA and RNA, protein-DNA or RNA interactions, chemical and enzymatic basis for gene expression, and recombinant DNA methods.",
        "prereqs": "CHEM 130C or CHEM 135 (or equivalent with a grade of C or better; C- not accepted).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Alternate years."
    },
    {
        "title": "CHEM 234 - Enzymology",
        "units": "3 unit(s)",
        "description": "Enzyme structure, function, classification, isolation and methodology, mechanisms, theory of catalysis, enzyme kinetics, pH effects, allosterism and regulation.",
        "prereqs": "CHEM 130B or CHEM 135 (or equivalent with a grade of C or better; C- not accepted).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Alternate years."
    },
    {
        "title": "CHEM 236 - Biophysical Methods",
        "units": "3 unit(s)",
        "description": "Advanced lectures on theory and methodology of biophysical measurements. Topics selected from spectroscopic, electromigration and hydrodynamic methods. Practice, limitations and data reduction procedures for each method examined.",
        "prereqs": "CHEM 130A or CHEM 135 (or equivalent with a grade of C or better; C- not accepted) or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Alternate years."
    },
    {
        "title": "CHEM 245 - Advanced Inorganic Chemistry",
        "units": "3 unit(s)",
        "description": "Advanced topics of current interest in inorganic chemistry.",
        "prereqs": "CHEM 145 (or equivalent with grade of C or better; C- not accepted).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Alternate years."
    },
    {
        "title": "CHEM 250 - Current Topics in Analytical Chemistry",
        "units": "3 unit(s)",
        "description": "Lecture, discussion and reading assignments on special topics in analytical chemistry. Topics vary each semester. Course may be repeated for credit for different topics.",
        "prereqs": "CHEM 155 (or equivalent with a grade of C or better; C- not accepted).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 268 - Laser Spectroscopy",
        "units": "3 unit(s)",
        "description": "Importance of spectroscopy. Interaction of radiation with matter. Instrumentation for laser spectroscopy. Examples of various techniques, cw and pulsed.",
        "prereqs": "PHYS 110B , PHYS 158 or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Cross-listed with PHYS 268 . Physics and Astronomy is responsible for scheduling.",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 270 - Advanced Chemistry",
        "units": "1-5 unit(s)",
        "description": "Lectures, discussions and reading assignments in special fields of chemistry. Topics vary. May be repeatable for maximum of 15 units. Course may be repeated for credit for up to 15 units.",
        "prereqs": "Satisfactory background in upper division chemistry and instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 276 - Physical Polymer Chemistry",
        "units": "3 unit(s)",
        "description": "Techniques for characterizing molecular weights of polymers, their distribution functions, polymer chain statistics and solution thermodynamics.",
        "prereqs": "Satisfactory background in upper division chemistry or materials science or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Alternate years."
    },
    {
        "title": "CHEM 285 - Seminar",
        "units": "5 unit(s)",
        "description": "Presentation of chemical topics by graduate students, faculty and guests. A maximum of 3 units may be repeated. Course may be repeated for credit for up to 3 units.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 293 - Applied Bioinformatics",
        "units": "3 unit(s)",
        "description": "Bioinformatics theory and applications including sequence search, proteomics, molecular modeling, and combinatorial chemistry. Students will work in teams and be guided in independent inquiry to solve practical bioinformatics problems.",
        "prereqs": "Senior or graduate standing in engineering or science.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Cross-listed with CHE 293 . Chemical Engineering is responsible for scheduling.",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 297 - MA Special Study",
        "units": "1-3 unit(s)",
        "description": "Supervised individual MA project. Maximum of 12 units may be repeated. Course may be repeated for credit for up to 12 units.Pre/",
        "prereqs": "No prerequisites",
        "coreqs": "CHEM 201 and instructor consent. Not available to Open University Students",
        "grading_type": "Credit/No Credit",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 298 - Research",
        "units": "1-6 unit(s)",
        "description": "Supervised individual laboratory work or directed chemical field studies for the student with adequate preparation. Maximum of 12 units may be repeated. Course may be repeated for credit for up to 12 units.Pre/",
        "prereqs": "No prerequisites",
        "coreqs": "CHEM 120S , CHEM 201 and instructor consent. Not available to Open University Students",
        "grading_type": "Mandatory Credit/No Credit/RP",
        "note": "No additional notes"
    },
    {
        "title": "CHEM 299 - Masters Thesis",
        "units": "1-6 unit(s)",
        "description": "Maximum of 6 units may be repeated. Course may be repeated for credit for up to 6 units.",
        "prereqs": "CHEM 298 , instructor consent and advancement to candidacy for the masters degree. Not available to Open University Students",
        "coreqs": "No corequisites",
        "grading_type": "Mandatory Credit/No Credit/RP",
        "note": "1-2 units per semester."
    },
    {
        "title": "CHEM 1290R - Culminating Experience Supervision",
        "units": "1 unit(s)",
        "description": "Continued work on thesis or project. Course may be repeated for credit for up to 16 units.",
        "prereqs": "Outstanding RP grade in a preceding semester in CHEM 299, Masters Thesis",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit/No Degree Credit",
        "note": "No Degree Credit."
    },
    {
        "title": "PHYS 1 - Elementary Physics",
        "units": "3 unit(s)",
        "description": "Mechanics, energy, electricity, magnetism, optics, atomic and nuclear physics, properties of matter; emphasizes practical applications of physics principles to contemporary problems.  Satisfies B1: Physical Science.",
        "prereqs": "The following Declared Majors are not allowed to enroll in this course:Engineering, Chemistry, Geology, Meteorology, Physics, Earth Science.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 2A - Fundamentals of Physics",
        "units": "4 unit(s)",
        "description": "First semester of a two-semester sequence that is non-calculus based and covers the topics of mechanics, heat, and sound.  Lecture 1 hour/Lab 3 hours/Discussion 2 hours.Satisfies B1: Physical Science + B3: Laboratory.",
        "prereqs": "Algebra. Department permission needed if this course is not required for students major.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded.",
        "note": "Year course. Declared Physics majors not allowed."
    },
    {
        "title": "PHYS 2B - Fundamentals of Physics",
        "units": "4 unit(s)",
        "description": "Electricity and magnetism, optics and atomic structure. Misc/Lab: Lecture 3 hours/lab 3 hours.Satisfies B1 + B3: Physical + Lab Science.",
        "prereqs": "PHYS 2A (with grade of C- or better).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Declared Physics majors not allowed."
    },
    {
        "title": "PHYS 20 - Invitation to Physics and Astronomy",
        "units": "1 unit(s)",
        "description": "Introduction to the physics department, its faculty, and basic skills necessary for success as a physics major. Topics include relativity and quantum theory for beginners, careers in physics and astronomy, career pathways of BA/BS physics recipients, the role of research in undergraduate STEM education, a historical perspective on the field of physics, and physics/astronomy in the news.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 23 - Animation Physics",
        "units": "3 unit(s)",
        "description": "This course presents principles and concepts of physics relevant to animation and special effects. Students will demonstrate mastery of this scientific knowledge in the critical analysis of films, shows, video games, etc., and in creating their own animated shorts.  Satisfies B1: Physical Science.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 40 - Introduction to Computational Physics",
        "units": "3 unit(s)",
        "description": "An introduction to programming for physics majors who have no previous programming experience. Problem solving, data visualization and analysis using computational methods. Lecture 2 hours/Lab 3 hours.",
        "prereqs": "PHYS 50 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 49 - Introduction to Physics",
        "units": "3 unit(s)",
        "description": "A preparatory course in physics for science and engineering majors, emphasizing significant figures, unit conversions, vectors, quantitative reasoning. Introduction to Newtons Laws and conservation laws. The relevance of physics to science and engineering careers.",
        "prereqs": "MATH 19 or pre-calc placement test",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 50 - General Physics I: Mechanics",
        "units": "4 unit(s)",
        "description": "A calculus-based treatment of particle kinematics and dynamics, work, energy, momentum, rotational motion, equilibrium, and simple harmonic motion. Lecture 3 hours/lab 3 hours.Satisfies B1: Physical Science + B3: Laboratory.",
        "prereqs": "Writing Enrollment Category I / II / III or GE Area A2 completed (grade of C- or better) or ENGL 1AF (grade of CR); AND, 3 or better on AP Calculus Test, or C- or better in MATH 30 /30X . Allowed declared majors: College of Science or Engineering.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 50W - General Physics/Mechanics Workshop",
        "units": "1 unit(s)",
        "description": "A discussion course for students concurrently registered in PHYS 50 General Physics/Mechanics covering problem solving methods as related to topics normally covered in PHYS 50 . Course may be repeated for credit for up to 3 units.",
        "prereqs": "No prerequisites",
        "coreqs": "PHYS 50",
        "grading_type": "Credit/No Credit",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 51 - General Physics II: Electricity and Magnetism",
        "units": "4 unit(s)",
        "description": "A calculus-based introduction to electricity and magnetism, covering electric charges, electric and magnetic fields, dc and ac circuits, and electromagnetic waves. Lecture 3 hours/lab 3 hours.Satisfies B1: Physical Science + B3: Laboratory.",
        "prereqs": "PHYS 50 , MATH 31 or MATH 31X , both with grades of C- or better. Allowed declared majors: College of Science or Engineering majors only.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 52 - General Physics III: Waves, Light, Heat",
        "units": "4 unit(s)",
        "description": "Mechanical waves, light, spectra, quantization of electromagnetic radiation; geometric and physical optics; temperature, heat, and thermodynamics. Lecture 3 hours/lab 3 hours.Satisfies B1: Physical Science + B3: Laboratory.",
        "prereqs": "PHYS 51 with grade of C- or better. Allowed declared majors: College of Science or Engineering majors only.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 92 - International Program Studies",
        "units": "1-6 unit(s)",
        "description": "Study Abroad and Away transfer credit course. Study Abroad and Away provides students the opportunity to study abroad on long term programs (Exchange Programs, CSU International Programs, and International Student Exchange Programs) and short-term programs (Faculty-Led Programs and Summer School Abroad Programs) for academic credit, offering Alternative Break Programs for cultural immersion, and designing other globally focused opportunities. This course is designated as a placeholder course for Study Abroad and Away programs.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Mixed Grading",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 100W - Methods of Research and Communication in Physics",
        "units": "3 unit(s)",
        "description": "Develop communication skills for physics, including proposals, posters, research reports and oral presentations. Research strategies and methodologies for effective communication to general and specialized audiences. Satisfies Writing in the Disciplines (WID).",
        "prereqs": "A3 or equivalent second semester composition course (with a grade of C- or better); completion of core GE; and upper division standing. Or Graduate or Postbaccalaureate level.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Must be passed with C or better to satisfy the CSU Graduation Writing Assessment Requirement (GWAR)."
    },
    {
        "title": "PHYS 105A - Advanced Mechanics I",
        "units": "4 unit(s)",
        "description": "Dynamics of particles, Newtons laws, Lagranges and Hamiltons equations, conservation laws, symmetry and the laws of physics, oscillations, central-force motion, and non-inertial reference frames.",
        "prereqs": "PHYS 52 , MATH 33A , each with grade of C- or better.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Year course."
    },
    {
        "title": "PHYS 105B - Advanced Mechanics II",
        "units": "3 unit(s)",
        "description": "Dynamics of systems of particles: collisions, rigid body rotations, non-inertial frames, coupled oscillations, waves. This course is strongly recommended for students who are considering graduate study in physics.",
        "prereqs": "PHYS 105A with grade C- or better.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 107 - Waves and Oscillations",
        "units": "3 unit(s)",
        "description": "Oscillatory phenomena and their connection to waves. Review of simple harmonic motion and extension to damped, driven, and coupled oscillators. Applications to waves on strings, and basic concepts of electromagnetic and sound waves. Connections to the beginnings of quantum theory are developed.",
        "prereqs": "PHYS 52 (or equivalent coverage of waves and oscillations) and PHYS 105A , both with C- or better.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 110A - Electricity and Magnetism I",
        "units": "3 unit(s)",
        "description": "Theories of electrostatics, magnetostatics, electrodynamics and electromagnetic waves.",
        "prereqs": "PHYS 130 , MATH 33A , each with C- or better.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Year course."
    },
    {
        "title": "PHYS 110B - Electricity and Magnetism II",
        "units": "3 unit(s)",
        "description": "Theories of electrostatics, magnetostatics, electrodynamics and electromagnetic waves.",
        "prereqs": "PHYS 110A",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 120A - Electronics, Data Acquisition & Analysis",
        "units": "3 unit(s)",
        "description": "The characteristics of basic analog and digital electronic circuits used in a scientific laboratory. Topics include transistors, operational amplifiers, digital electronic circuits, and computer data acquisition. Misc/Lab: Seminar 2 hours/lab 3 hours.",
        "prereqs": "PHYS 51 with C or better. Physics Majors Only",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 120B - Advanced Scientific Measurements Lab",
        "units": "3 unit(s)",
        "description": "Modern experimental techniques in the context of modern and solid state physics. Examples include phase sensitive detection, spectrum analysis, four-point-probe resistivity measurements, and related techniques. Seminar 1 hour/Lab 6 hours.",
        "prereqs": "PHYS 122 and PHYS 120A both with C or better. Physics Majors only.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 120C - Advanced Physics Lab: Optics and Lasers",
        "units": "3 unit(s)",
        "description": "Design of optical systems involving lasers and other common optical components. Use of optical systems to explore interference, holography, and other optical phenomena. Misc/Lab: Lecture 1 hour/lab 6 hours.",
        "prereqs": "PHYS 120A and PHYS 158 all with grade of C- or better.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 121S - Radiation Safety",
        "units": "1-2 unit(s)",
        "description": "Health hazards involved in working with radioactive substances. Physical nature of hazards, biological effects, standards of permissible exposures, safety precautions and protection techniques. Two units meet State of California recommendations.",
        "prereqs": "Lower division calculus, chemistry and physics.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Cross-listed with CHEM 121S / NUCS 121S . Chemistry is responsible for scheduling.",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 122 - Modern Physics",
        "units": "4 unit(s)",
        "description": "Survey of modern physics for science majors, covering special relativity, pre-quantum theory, basic quantum mechanics, atomic and molecular physics, solid state physics, nuclear and particle physics, and cosmology. Historical foundations of these topics will also be are presented.",
        "prereqs": "CHEM 1A , MATH 32 , and PHYS 52 all with a C- or better.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 126 - Introduction to Nuclear Science",
        "units": "3 unit(s)",
        "description": "Properties of the atomic nucleus. Applications of nuclear science in biology, chemistry, engineering, geology and physics.",
        "prereqs": "Lower division calculus, chemistry and physics.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Cross-listed with CHEM 126 / NUCS 126 . Chemistry is responsible for scheduling.",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 127 - Nuclear Science Lab",
        "units": "3 unit(s)",
        "description": "Basic techniques and procedures used in nuclear science. Nuclear decay, nuclear reactions, radiation detection and measurements, nuclear analytical methods and tracer techniques. Misc/Lab: Lecture 1 hour/lab 6 hours.",
        "prereqs": "NUCS 121S , CHEM 100W and CHEM 126 (with grades of C or better; C- not accepted); or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "ABC-/No Credit Cross-listed with CHEM 127 / NUCS 127 . Chemistry is responsible for scheduling.",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 130 - Mathematical Methods in Physics",
        "units": "4 unit(s)",
        "description": "Mathematical methodologies commonly used in physics, including linear algebra, vector calculus, partial differential equations and complex variables, and their applications to classical mechanics, electricity and magnetism, and quantum mechanics.",
        "prereqs": "MATH 32 or MATH 32X , and PHYS 52 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 140 - Computational Methods in Physics",
        "units": "3 unit(s)",
        "description": "An introduction to the programming of algorithms and numerical techniques pertinent to physical systems. Misc/Lab: Seminar 2 hours/lab 3 hours.",
        "prereqs": "PHYS 40 or previous programming experience; PHYS 52 with a C- or better. Physics Majors Only.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 155 - Topics in Physics and Astronomy",
        "units": "3-9 unit(s)",
        "description": "Trending topics of physics and astronomy research and areas of special interest. Content varies by semester. Course repeatable when topic changes for a total of 9 units.",
        "prereqs": "PHYS 52 , and MATH 32 or MATH 32X , both with a C- or better. Or Instructor Consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 158 - Modern Optics",
        "units": "3 unit(s)",
        "description": "Thin and thick lens systems. Double and multiple beam interference, holography, Fraunhofer and Fresnel diffraction, Fourier optics, spatial filtering, polarization and birefringence.",
        "prereqs": "PHYS 52 with a C- or better; MATH 32 or MATH 32X .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 160 - Thermodynamics and Statistical Physics",
        "units": "3 unit(s)",
        "description": "The laws of thermodynamics and kinetic theory with introduction to statistical mechanics.",
        "prereqs": "CHEM 1A and PHYS 52 both with a C- or better; MATH 32 or MATH 32X .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 161 - Fundamentals of Quantum Information",
        "units": "3 unit(s)",
        "description": "Introduction to fundamental topics in quantum information science (QIS). Course covers select concepts in quantum theory used in quantum technology including discrete quantum systems, measurements, quantum states, and gate operations. Modern applications of QIS including quantum communication, quantum computing, and physical realizations of quantum bits are discussed.",
        "prereqs": "PHYS 51 and one of the following: PHYS 130 or MATH 33LA or MATH 39 . All with C- or better. Or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 163 - Quantum Mechanics",
        "units": "3 unit(s)",
        "description": "General principles of quantum theories. Wave functions, operator algebra and approximation methods. Applications to atomic structure and solid state physics.",
        "prereqs": "PHYS 122 , MATH 33A , PHYS 130 , all with a grade of C- or better.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 168 - Lasers",
        "units": "3 unit(s)",
        "description": "Properties of lasers and Gaussian light beams. Principles of laser operation and design. Application of lasers.",
        "prereqs": "PHYS 122 and PHYS 158 with a C- or better.",
        "coreqs": "PHYS 110B .",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 175A - Solid State Physics",
        "units": "3 unit(s)",
        "description": "A detailed treatment of the physics of solids using quantum mechanics, crystallography, electromagnetism, and metallurgy.",
        "prereqs": "PHYS 122 with grade of C- or better.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 180 - Individual Studies",
        "units": "1-4 unit(s)",
        "description": "Advanced work in special fields.",
        "prereqs": "Physics major or minor. Not available to Open University Students.",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "Maximum 4 units of 180/184 may be applied toward graduation."
    },
    {
        "title": "PHYS 184 - Directed Reading",
        "units": "1-3 unit(s)",
        "description": "Assigned readings of selected books, journals and special papers to fill gaps in training or for contact with new fields. Weekly reports and conferences.",
        "prereqs": "Not available to Open University Students.",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "Maximum 4 units of 180/184 may be applied toward graduation."
    },
    {
        "title": "PHYS 192 - International Program Studies",
        "units": "1-6 unit(s)",
        "description": "Study Abroad and Away transfer credit course. Study Abroad and Away provides students the opportunity to study abroad on long term programs (Exchange Programs, CSU International Programs, and International Student Exchange Programs) and short-term programs (Faculty-Led Programs and Summer School Abroad Programs) for academic credit, offering Alternative Break Programs for cultural immersion, and designing other globally focused opportunities. This course is designated as a placeholder course for Study Abroad and Away programs.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Mixed Grading",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 196B - Physics Education: Theory and Practice",
        "units": "3 unit(s)",
        "description": "Instructional Student Assistants and Teaching Associates integrate educational theory, pedagogy, content, and practice by focusing on practical concerns and associated theoretical models. Weekly readings, in-class discussions, out-of-class data collection, reflections, projects, and presentations based on classroom teaching experience.",
        "prereqs": "PHYS 50 , PHYS 2A , or equivalent",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 200W - Research and Communication in Physics",
        "units": "3 unit(s)",
        "description": "Learn and develop modern research and communication skills for physics and astronomy, including literature review, proposal writing, posters, research reports, theses, publications, resume/CV, and oral presentations. Research strategies and methodologies for effective communication to general and specialized audiences. Satisfies GWAR: Graduation Writing Assessment Requirement.",
        "prereqs": "Graduate standing.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "This course satisfies graduate-level GWAR in this masters program."
    },
    {
        "title": "PHYS 205 - Advanced Dynamics",
        "units": "3 unit(s)",
        "description": "Generalized methods and selected topics in classical mechanics.",
        "prereqs": "PHYS 105A , PHYS 130 , and MATH 33A , or equivalents; or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 208 - Introduction to Electro-Optics",
        "units": "3 unit(s)",
        "description": "This course introduces the physical principles of electro-optics including modulators (electro- and acousto-optic), non-linear optics, semiconductor lasers, optical detection and integrated optics with applications.",
        "prereqs": "PHYS 158",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 210 - Electromagnetic Theory",
        "units": "3 unit(s)",
        "description": "Advanced topics in electromagnetic theory; Maxwells equations; solutions of Laplaces and Poissons equations; Green functions; electromagnetic properties of materials; electromagnetic waves and wave propagation.",
        "prereqs": "PHYS 230 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 220E - Graduate Optics Lab",
        "units": "3 unit(s)",
        "description": "Covers the application of Lasers and Optics with emphasis on topics such as Gaussian beams, Fabry-Perot cavities, Laser oscillators including CW and pulsed operation, non-linear optics, frequency stabilization and Fourier Optics. Communication of scientific content through written communication. Lecture 2 hours/Lab 3 hours.Satisfies GWAR: Graduation Writing Assessment Requirement.",
        "prereqs": "PHYS 120C or PHYS 208 or PHYS 258 or PHYS 268 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded.",
        "note": "This course satisfies graduate-level GWAR in this masters program."
    },
    {
        "title": "PHYS 230 - Methods in Mathematical Physics",
        "units": "3 unit(s)",
        "description": "Partial differential equations and special functions: Bessel functions, Legendre polynomials, spherical harmonics; Greens functions; complex variables and contour integrations; matrices and eigenvalue problems; Fourier and Laplace transforms.",
        "prereqs": "MATH 33A and PHYS 130 , or equivalents; or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 240 - Computational Physics",
        "units": "3 unit(s)",
        "description": "Numerical techniques and computational methods applied to solving problems from various branches of physics.",
        "prereqs": "PHYS 40 , PHYS 105A , and PHYS 163 , or equivalents; or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 250 - Quantum Programming",
        "units": "3 unit(s)",
        "description": "Introduction to quantum algorithms and programming a quantum computer. Includes a review of relevant quantum mechanical concepts, topics from linear algebra and complex numbers, spins and qubits, quantum gates and circuits, entanglement, quantum algorithms, such as Deutsch-Jozsa, Grover, quantum Fourier transforms.",
        "prereqs": "Graduate standing, or PHYS 163 and instructor approval.",
        "coreqs": "No corequisites",
        "grading_type": "Letter graded.",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 253 - Quantum Many-Body Physics",
        "units": "3 unit(s)",
        "description": "From the perspective of quantum information science, the course builds functional understanding of phase transitions and quantum simulations via systems of interacting spins. Systems of non-interacting Bosons and Fermions will be examined, followed by an examination of interacting particles via the Hubbard model and some coverage of numerical solutions for small systems.",
        "prereqs": "Graduate standing and PHYS 161 , or equivalent with approval of program advisor.",
        "coreqs": "No corequisites",
        "grading_type": "Letter graded.",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 255 - Advanced Topics in Physics",
        "units": "3 unit(s)",
        "description": "Selected topics in physics. Topics vary each semester. Course is repeatable when content changes.",
        "prereqs": "Suitable upper division background in physics and mathematics.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 255C - Celestial Mechanics",
        "units": "3 unit(s)",
        "description": "Basic concepts in celestial mechanics emphasizing orbital mechanics and the calculation of orbital perturbation. Topics covered include dynamical principles, potential theory, planetary equations, the disturbing function, Lagranges perturbation equations and geopotential perturbations.",
        "prereqs": "Senior or graduate standing.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 257 - General Relativity",
        "units": "3 unit(s)",
        "description": "General Relativity is the foundation for modern understanding of space and time. Coverage includes review of Special Relativity followed by the development of the mathematical tools of tensor calculus and Riemannian geometry and derivation of Einsteins field equations from the postulates of General Relativity. Topics covered include the energy-momentum tensor, geodesics, and curvature tensors, as well as applications of the theory to Black Holes, gravitational waves, and cosmology.",
        "prereqs": "PHYS 130 and PHYS 110B , or equivalent. Upper division standing or graduate standing.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 258 - Optics",
        "units": "3 unit(s)",
        "description": "Fourier optics, diffraction theory, imaging and image enhancement, holography and information processing.",
        "prereqs": "PHYS 158 and MATH 33A .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 260 - Statistical Mechanics",
        "units": "3 unit(s)",
        "description": "Classical and quantum statistics with applications to properties of matter. Principles of thermodynamics.",
        "prereqs": "PHYS 160 and PHYS 163 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 263A - Quantum Theory",
        "units": "3 unit(s)",
        "description": "Postulates of quantum theory. The Schroedinger equation and its solution for simple physical systems. Heisenbergs matrix formulation of quantum mechanics. Approximation methods: Time dependent and time independent perturbation theory. Variational method.",
        "prereqs": "PHYS 163 , PHYS 230 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 268 - Laser Spectroscopy",
        "units": "3 unit(s)",
        "description": "Importance of spectroscopy. Interaction of radiation with matter. Instrumentation for laser spectroscopy. Examples of various techniques, cw and pulsed.",
        "prereqs": "PHYS 110B , PHYS 158 or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Cross-listed with CHEM 268 . Physics and Astronomy is responsible for scheduling.",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 275 - Solid State Physics",
        "units": "3 unit(s)",
        "description": "Properties of crystals; electric, magnetic and thermal properties of solids.",
        "prereqs": "PHYS 263A or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 277 - Magnetism and Superconductivity",
        "units": "3 unit(s)",
        "description": "Fundamental properties of magnetic and superconducting materials and devices and their applications. Topics include magnetic anisotropy, magnetic domains, magnetization dynamics, conventional and unconventional superconductivity, magnetic properties of superconductors, Josephson effects, and SQUID. Lecture 2 hours/lab 3 hours.",
        "prereqs": "PHYS 210 , PHYS 263A , or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 285 - Seminar",
        "units": "1 unit(s)",
        "description": "Meetings for the presentation and discussion of advanced studies in special fields including work by the faculty, guest investigators and graduate students. Topics will vary each semester.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit.",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 297 - Directed Research",
        "units": "1-5 unit(s)",
        "description": "Advanced work in special fields. Only open to currently enrolled graduate students. Course may be repeated for credit for up to 5 units.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Mandatory Credit/No Credit/RP",
        "note": "Not available to Open University students."
    },
    {
        "title": "PHYS 298 - Graduate Research Report",
        "units": "1-4 unit(s)",
        "description": "Graduate Research Report. Repeatable for credit.",
        "prereqs": "PHYS 297 and Instructor consent. Not available to Open University Students.",
        "coreqs": "No corequisites",
        "grading_type": "Mandatory Credit/No Credit/RP",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 299 - Masters Thesis",
        "units": "1-4 unit(s)",
        "description": "",
        "prereqs": "Advancement to candidacy for the masters degree. Not available to Open University Students.",
        "coreqs": "No corequisites",
        "grading_type": "Mandatory Credit/No Credit/RP",
        "note": "No additional notes"
    },
    {
        "title": "PHYS 1290R - Culminating Experience Supervision",
        "units": "1 unit(s)",
        "description": "Continued work on thesis or project. Course may be repeated for credit for up to 16 units.",
        "prereqs": "Outstanding RP grade in a preceding semester in Chem 299, Masters Thesis",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit/No Degree Credit",
        "note": "No Degree Credit."
    },
    {
        "title": "BME 25 - Introduction to Biomedical Engineering Design",
        "units": "2 unit(s)",
        "description": "Introduction to the broader field of biomedical engineering, with emphasis on design of biomedical devices. Development of familiarity with standards and software tools relevant to the biomedical engineering industry, packages for design and analysis, FDA and EU guidelines.",
        "prereqs": "CHEM 1A , ENGR 10 , with a grade of C- or better.",
        "coreqs": "MATH 31 or MATH 31X , and PHYS 50 .",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 65 - Biomedical Applications of Statics",
        "units": "3 unit(s)",
        "description": "Detailed study of bodies in equilibrium as they apply to biomedical systems. Two-dimensional analysis of human joints and load-bearing implants are explored. Topics include free body diagrams, anthropometric measurements, internal forces, loading types, and stress shielding. 2 hours lecture/3 hours lab.",
        "prereqs": "MATH 31 or MATH 31X , and PHYS 50 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 68 - Biomedical Applications of Metals and Ceramics",
        "units": "3 unit(s)",
        "description": "Fundamentals of the structure, processing, and properties of metals and ceramics used in medical technology. Emphasis is placed on using metals and ceramics for implantable and non-implantable biomedical devices. Recent trends in biomaterials are explored.",
        "prereqs": "CHEM 1A , MATH 31 or MATH 31X , PHYS 50 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 115 - Foundations of Biomedical Engineering",
        "units": "4 unit(s)",
        "description": "Introduction to the fundamental principles of biomedical engineering. Core conservation equations are applied to mass, energy, charge, and momentum transfer in biomedical systems. Additional topics provide a breadth of exposure in cell and molecular biology, diagnostics and analytical techniques, statistical analysis of biomedical data, bioinformatics, bioinstrumentation, FDA regulations, and biomedical ethics. Lecture 2 hours/Lab 3 hours.",
        "prereqs": "BIOL 30 , CHEM 1B , ENGR 10 , MATH 32 or MATH 32X , and PHYS 50 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 116 - Biosensors and Bioinstrumentation",
        "units": "3 unit(s)",
        "description": "Biomedical applications of biosensors and instrumentation systems. Design and development of new instrumentation. Systems for measuring biological signals, biopotentials, pressure, stress, temperature, and optical properties. Biosensors based on different transducer systems and sensing elements. USFDA regulations and safety considerations. Lecture 2 hours/Lab 3 hours.",
        "prereqs": "PHYS 51 , BME 115 , BME 177 , or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 117 - Biotransport Phenomena",
        "units": "3 unit(s)",
        "description": "Applications of fundamentals of thermodynamic and kinetic aspects of energy and mass transport phenomena to biological systems. Development of quantitative description of transport processes beginning from the molecular level to entire organ systems.",
        "prereqs": "BME 115 , MATH 33A or MATH 33LA , BME 130 all with a grade of C- or better.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 130 - Numerical Methods in Biomedical Engineering",
        "units": "3 unit(s)",
        "description": "Course applies computational and numerical analysis techniques to myriad Engineering problems. The course focus is on application of numerical analysis to BME topics ranging from image analysis to nonlinear systems. We will employ various computational tools, including MATLAB/Simulink and ImageJ. Lecture 2 hours/Lab 3 hours.",
        "prereqs": "MATH 32 or MATH 32X , BIOL 30 , and CHEM 1B all with a grade of C- or better.",
        "coreqs": "BME 115 , MATH 33A or MATH 33LA .",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 133 - Programming Applications in Biomedical Engineering",
        "units": "1 unit(s)",
        "description": "Introduction to applied programming applications in biomedical engineering. Use of Python, JMP. ImageJ to gather, organize, analyze, and present various data types, especially those pertinent to biomedical engineers working in FDA-regulated environments. Lab 3 hours.",
        "prereqs": "BME 25 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 135 - Biomedical Engineering Design Methods",
        "units": "2 unit(s)",
        "description": "Review of FDA-required design methods. Application of engineering drafting and design principles to the development of biomedical devices and manufacturing processes. Use of computer-aided design (CAD) tools to generate 3-D models and 2-D drawings of parts and assemblies. Application tolerances for statistical process control. Lecture 1 hour/lab 3 hours.",
        "prereqs": "BME 25 and ENGR 10 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 147 - Quantitative and Statistical Methods for Biomedical Engineers",
        "units": "3 unit(s)",
        "description": "Descriptive statistics; hypothesis testing; linear and nonlinear model regression; statistical approach to medical device verification and validation; statistical sampling plans; analysis of survival data; bioinformatics; quantitative methods for design and testing of biomedical devices; programming for statistical analysis (R, Matlab).",
        "prereqs": "MATH 32 or MATH 32X or MATH 32H with a grade of C- or better.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 165 - Applied Engineering Biomechanics",
        "units": "3 unit(s)",
        "description": "Exploration of structural biomechanics applied to the human body. Students compare linear and nonlinear elastic, and viscoelastic models for describing the behavior of musculoskeletal tissues and implants. Concepts include bone remodeling, osteoarthritis, implant failure, muscle contraction, and cardiac mechanics.",
        "prereqs": "CE 95 , CE 99 , BME 65 or equivalent; And MATE 25 or BME 68 or equivalent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 168 - Medical and Biological Polymers",
        "units": "3 unit(s)",
        "description": "Polymers applications in medical devices and equipment, biological and biodegradable polymers, structure-processing-properties relationships, chemistry, thermal transitions, mechanical, electrical and optical properties, clinical outcomes and complications arising from use of polymers, regulatory framework for polymer use in humans. Lecture 2 hours/Lab 3 hours.",
        "prereqs": "BME 68 or MATE 25 with C- or better",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 174 - Biomedical Regulatory Requirements",
        "units": "3 unit(s)",
        "description": "Study of Food and Drug Administration regulations for design of biomedical engineering products and processes, including design review and documentation processes; Good Laboratory Practices; Good Manufacturing Practices; quality and reliability requirements.",
        "prereqs": "ENGR 100W , BME 115",
        "coreqs": "BME 177",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 177 - Physiology for Engineers",
        "units": "3 unit(s)",
        "description": "Structure and function of physiological systems and discussion of topics of particular importance to the design, development, construction and clinical application of biomedical devices. Practical laboratory application of technologies to monitor, repair, replace or augment physiological systems. Lecture 2 hours/Lab 3 hours.",
        "prereqs": "BIOL 30 , CHEM 1B , PHYS 50",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Cross-listed with BIOL 177 . Biomedical Engineering is responsible for scheduling.",
        "note": "No additional notes"
    },
    {
        "title": "BME 178 - Biomedical Product Realization",
        "units": "3 unit(s)",
        "description": "Basics of product realization from concept to clinical trials to prepare students for career(s) in multiple bioengineering sectors. Specific topics include: Product Concept, Research & Development, Design Controls in Application, Design Verification and Design Validation, Process Control in Application, Software Validation, Effective Risk Management, Engineering and Quality Management System Practices.",
        "prereqs": "ENGR 100W , BME 147 , BME 174 all with a grade of C- or better.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 180 - Individual Studies",
        "units": "1-3 unit(s)",
        "description": "Individual work on special topics. Students work with faculty and/or industry mentors on design, research, lab development or other types of projects.",
        "prereqs": "Upper division standing",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "No additional notes"
    },
    {
        "title": "BME 182 - Orthotics and Prosthetics",
        "units": "3 unit(s)",
        "description": "Diagrammatic breakdown of prosthetic design covering patient interfaces, socket designs, materials, modular components, prosthetic feet, prosthetic knees, upper extremity designs. Treatment options within current standard of care, device design trends, future device, material, and design needs.",
        "prereqs": "CE 95 or CE 99 , MATE 25 , BME 115 , BME 177",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 185 - Digital Health",
        "units": "3 unit(s)",
        "description": "Benefits and challenges related to digital health, the technology trends, and the modernization of medical devices. Specific topics include software as a medical device, related cybersecurity elements and FDA/NIST guidance, device software functions, mobile medical applications, health information technology, medical device data systems, medical device interoperability, telemedicine, and wireless medical devices.",
        "prereqs": "BME 115 , BME 133",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 187 - Medical Device Quality Systems",
        "units": "3 unit(s)",
        "description": "Introduction to the quality management system (QMS) framework for medical devices, principles of QMS, product and service quality evaluation, and control. Topics include: document control, supplier management, training, audits, reliability assessment, feedback and monitoring, quality tools for investigation, and continuous improvement techniques.",
        "prereqs": "BME 174 .Pre/",
        "coreqs": "BME 147 or instructor consent.",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 188 - Biomedical Device Manufacturing",
        "units": "3 unit(s)",
        "description": "Overview of manufacturing processes for producing biomedical devices, implants, instruments, prosthetics, and capital equipment. Introduction to design processes and tools that facilitate start-up and expansion of manufacturing activities.",
        "prereqs": "BME 25 , MATE 25 , BME 115 , BME 177 , all with C- or better",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 192 - International Program Studies",
        "units": "1-12 unit(s)",
        "description": "Study Abroad and Away transfer credit course. Study Abroad and Away provides students the opportunity to study abroad on long term programs (Exchange Programs, CSU International Programs, and International Student Exchange Programs) and short-term programs (Faculty-Led Programs and Summer School Abroad Programs) for academic credit, offering Alternative Break Programs for cultural immersion, and designing other globally focused opportunities. This course is designated as a placeholder course for Study Abroad and Away programs.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Mixed Grading",
        "note": "No additional notes"
    },
    {
        "title": "BME 198A - Senior Design Project I",
        "units": "2 unit(s)",
        "description": "Descriptive statistics; hypothesis testing; linear and nonlinear model regression; statistical approach to medical device verification and validation; statistical sampling plans; analysis of survival data; bioinformatics; quantitative methods for design and testing of biomedical devices; programming for statistical analysis (R, Matlab). Lecture 1 hour/Lab 3 hours.Satisfies SJSU Studies S: Self, Society & Equality in U.S. when taken with BME Major sequence.",
        "prereqs": "MATH 32 or MATH 32H or MATH 32X , BME 115 , and BME 177 all with a grade of C- or better. Completion of Core General Education and upper division standing are prerequisites to all SJSU studies courses. Completion of, or co-registration in, 100W is strongly recommended.\nAllowed Declared Major: Biomedical Engineering or Graduate Standing.",
        "coreqs": "BME 147 .",
        "grading_type": "Letter Graded",
        "note": "Meets GE Areas S and V when course is taken in combination with: BME 198B , ENGR 195A and ENGR 195B ."
    },
    {
        "title": "BME 198B - Senior Design Project II",
        "units": "2 unit(s)",
        "description": "Continuation of BME 198A. Culmination of project requiring formal oral presentation and report consisting of documentation of project methodology and results. when taken with BME major sequence. Lecture 1 hour/Lab 3 hours.Satisfies SJSU Studies V: Cultures and Global Understanding.",
        "prereqs": "BME 198A with C or better; BME 147 with C- or better. Passage of the Writing Skills Test (WST) or ENGL 100A / LLD 100A with a C or better (C- not accepted), completion of Core General Education and upper division standing are prerequisites to all SJSU studies courses. Completion of, or co-registration in, 100W is strongly recommended. Allowed Declared Major: Biomedical Engineering or Graduate Standing. Pre/",
        "coreqs": "ENGR 195B .",
        "grading_type": "Letter Graded",
        "note": "All of SJSU Studies courses require completion of the WST and upper division standing. Meets GE Areas S and V when course is taken in combination with: BME 198A , ENGR 195A and ENGR 195B ."
    },
    {
        "title": "BME 207 - Experimental Methods in BME",
        "units": "3 unit(s)",
        "description": "Introduction to experimental methods and techniques used in Biomedical Engineering. Principles of data representation, analysis, and experimental designs in bioreactors, biomaterials, and medical devices. Topics include error analyses, modeling, normality testing, hypothesis testing. This is a hands-on course, and students will operate equipment in the departments laboratories. 2 hours lecture/3 hours lab.",
        "prereqs": "BME 115 and graduate standing.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 210 - Mathematical Methods in Biomedical Engineering",
        "units": "3 unit(s)",
        "description": "Mathematical and computational methods applied to biomedical engineering. Topics include: i) statistical analysis of biomedical datasets, ii) design of experiments to meet FDA requirements, iii) solution techniques for partial differential equations, and iv) modeling of stochasticity in biological systems including error analysis.",
        "prereqs": "CMPE 30, MATH 33LA or MATH 33A. Or Graduate standing or by instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 217 - Experimental and Computational Biofluid Mechanics",
        "units": "3 unit(s)",
        "description": "Introduction to blood rheology, cardiovascular fluid mechanics, blood flow dynamics in blood vessels and in proximity of implanted cardiovascular devices, airflow in the lungs, and other physiological flow phenomena. Healthy and diseased states will be considered. Students will familiarize with both experimental and computational approaches to measure physiological flows.",
        "prereqs": "BME 117 and BME 210 and Graduate standing; or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 254 - Microscale Biomedical Systems: Physics and Applications",
        "units": "3 unit(s)",
        "description": "Introduction to microscale physics and phenomena used in biomedical systems; analytical techniques and diagnostic applications. Course will discuss: microscale fluid mechanics (Navier-Stokes), electrical phenomena (Maxwell), and particle/molecule/device interactions. Case studies focus on applications of microscale physics to biomedical engineering analyses.",
        "prereqs": "BME 117 , MATH 33A or MATH 33LA , and graduate standing; or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 256 - Biomedical Applications of Nanoplatforms",
        "units": "3 unit(s)",
        "description": "Biomedical applications of nanoplatforms explores the development of three cutting edge sub fields: nanoplatforms in therapeutics; nanoplatforms in prosthesis and implants; and nanoplatforms in diagnosis and screening. The socioeconomic risks and solutions of nanoplatforms in biomedical applications are also explored.",
        "prereqs": "BME 177 , Graduate Standing or instructor consent",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 258 - Medical Imaging for Engineers",
        "units": "3 unit(s)",
        "description": "Introduction to the principles and clinical applications of medical imaging. Interaction of radiation with matter. Image acquisition and manipulation. Clinical imaging techniques: X-ray radiography and computed tomography, ultrasound imaging, magnetic resonance imaging. Safety considerations. Computer laboratory: image enhancement, segmentation, contouring. Lecture 2 hours/Lab 3 hours.",
        "prereqs": "PHYS 51 , MATH 33A or MATH 33LA , BME 177 , and BME 210 . Or Instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 272 - Biomedical Device Design and Principles",
        "units": "3 unit(s)",
        "description": "Principles involved in designing medical devices to function reliably in human body; interaction between synthetic and biological materials; use of design principles during conception and development of medical devices; effect of design on manufacture clinical performance, reliability and quality/regulatory assurance.",
        "prereqs": "BME 115 , Graduate standing or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 274 - Regulatory, Clinical and Manufacturing Aspects of Medical Devices",
        "units": "3 unit(s)",
        "description": "FDA regulations related to medical devices; planning and implementation of clinical trials; sterilization techniques; failure mode analysis; quality control for medical device manufacture; intellectual property; field trips to device manufacturers. Satisfies GWAR: Graduation Writing Assessment Requirement.",
        "prereqs": "BME 115 , Graduate standing; or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "This course satisfies graduate-level GWAR in this masters program."
    },
    {
        "title": "BME 276 - Project Management in Biomedical Technologies",
        "units": "3 unit(s)",
        "description": "Context for the emergence of project management as a credible business discipline increasingly integrated into the functional and decision-making fabric of companies in the biomedical technology sector; exploration of the typical skillset of the modern project management professional and the teams they lead in companies developing medical devices and pharmaceutical therapies; fundamentals of applied traditional project management tools and techniques to medical device, pharmaceutical and combination product research, development and commercial launch; overview of typical development cycles including regulatory pathways, timeline management and risk mitigation approaches; exposure to contemporary technical project management challenges emerging from value perception, organizational politics, people and power dynamics including the imbalance of technical and commercial conflicts.",
        "prereqs": "Graduate standing or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 280 - Graduate Research Studies",
        "units": "1-3 unit(s)",
        "description": "Supervised individual research or directed studies for graduate students. Students work with faculty mentors on research-oriented projects, including comprehensive critical literature reviews, development of new testing or analysis methodologies, experimental or numerical investigations. The course is repeatable for credit up to two times for a maximum of 3 units.",
        "prereqs": "Graduate classified standing or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Mandatory Credit/No Credit/RP",
        "note": "No additional notes"
    },
    {
        "title": "BME 288 - Tissue Engineering",
        "units": "3 unit(s)",
        "description": "This course strikes a balance among the diversity of subjects that are related to tissue engineering, including biology, chemistry, material science, and engineering, among others. Emphasis on research areas of clinical value for engineering new organ systems.",
        "prereqs": "Graduate Standing or Instructor Consent",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 291 - MS Thesis/Project Preparation Seminar",
        "units": "3 unit(s)",
        "description": "Assists graduate students in the development and completion of their Masters thesis/project research proposal and exposes them to research projects being done by others in the BME program.",
        "prereqs": "BME 207 , Good standing (minimum GPA 3.0), classified status in the BME MS program, and Petition for Advancement to Graduate Candidacy form submitted.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "BME 298 - MS Project",
        "units": "3 unit(s)",
        "description": "Masters project work in Biomedical Engineering.",
        "prereqs": "Advancement to candidacy and BME 291 .",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "No additional notes"
    },
    {
        "title": "BME 298I - Masters Project Internship",
        "units": "1-2 unit(s)",
        "description": "Masters project work in Biomedical Engineering. This section is for students completing their Masters project work at an off-campus location.",
        "prereqs": "Advancement to candidacy and BME 291 .",
        "coreqs": "No corequisites",
        "grading_type": "Mandatory Credit/No Credit/RP",
        "note": "No additional notes"
    },
    {
        "title": "BME 299 - MS Thesis",
        "units": "3 unit(s)",
        "description": "Masters thesis work in Biomedical Engineering.",
        "prereqs": "Advancement to candidacy, BME 291 , BME 298 .",
        "coreqs": "No corequisites",
        "grading_type": "Mandatory Credit/No Credit/RP",
        "note": "No additional notes"
    },
    {
        "title": "BME 299I - Masters Thesis Internship",
        "units": "1-3 unit(s)",
        "description": "Masters thesis work in Biomedical Engineering. This section is for students completing their Masters thesis work at an off-campus location. Course may be repeated for credit for up to 3 units.",
        "prereqs": "Advancement to candidacy; BME 291 ; BME 298 or BME 298I ; or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Mandatory Credit/No Credit/RP",
        "note": "No additional notes"
    },
    {
        "title": "BME 1290R - Culminating Experience Supervision",
        "units": "1 unit(s)",
        "description": "Continued work on dissertation, thesis, or project or in preparation for comprehensive exams beyond the minimum required units for cases in which final deliverables are still in progress and all other degree requirements except the culminating experience have been fulfilled.",
        "prereqs": "Outstanding RP grade in a previous semester in BME 298 or BME 299",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit/No Degree Credit",
        "note": "No Degree Credit."
    },
    {
        "title": "DATA 200 - Computational Programming for Data Analytics",
        "units": "3 unit(s)",
        "description": "Computational thinking and problem solving; data structures, algorithms, iterations, functions, and other core concepts; standard libraries; functional programming and object-oriented programming; applications to data processing, data analytics, data visualization, and database manipulation.",
        "prereqs": "Admission into MS in Data Analytics and instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "No additional notes"
    },
    {
        "title": "DATA 220 - Mathematical Methods for Data Analytics",
        "units": "3 unit(s)",
        "description": "Mathematical and Statistical methods for Data Analytics. Selected topics from probability, statistics, linear algebra, and mathematical optimization. Programming for numerical implementation of mathematical and statistical algorithms.",
        "prereqs": "Instructor Consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "DATA 225 - Database Systems for Analytics",
        "units": "3 unit(s)",
        "description": "Design operational and analytical databases with relational, dimensional, and NoSQL data models; deploy data analytics applications with SQL programming and data access APIs; perform data cleansing, extract, transform, and load (ETL) operations for data warehouses and online analytical processing (OLAP).",
        "prereqs": "Classified standing or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "DATA 228 - Big Data Technologies and Applications",
        "units": "3 unit(s)",
        "description": "Leverage emerging big data systems, technologies, and applications to transform data into knowledge through capturing, managing, analyzing, and understanding large data at volumes and rates; design analytical solutions in data warehouse, big data databases, data streaming, security and governance.",
        "prereqs": "DATA 200 (or equivalent) and DATA 225 , or instructor consent",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "DATA 230 - Data Visualization",
        "units": "3 unit(s)",
        "description": "Study data visualization as an analytical tool, a medium of communication, and the basis for interactive dashboards; apply cognitive theories and design principles in the development of presentations and visualizations; create digital data visualizations using emerging software packages and environments.",
        "prereqs": "Classified standing or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "DATA 240 - Data Mining and Analytics",
        "units": "3 unit(s)",
        "description": "Learn data mining technologies for Knowledge Discovery in Databases (KDD) process including system architectures, functionalities, methodology, query language, user interaction, and performance; extract patterns and identify knowledge for diverse applications in data analytics, decision support, text mining, and stream mining.",
        "prereqs": "DATA 220 and DATA 225 , or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "DATA 245 - Machine Learning Technologies",
        "units": "3 unit(s)",
        "description": "Learn concepts, techniques and algorithms in machine learning for the development of real-world applications; build, evaluate and refine machine learning models to predict patterns from trained data sets; apply supervised and unsupervised learning methodologies in solving classification and regression problems.",
        "prereqs": "DATA 220 and DATA 225 , or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "DATA 250 - Large Scale Data Analytics",
        "units": "3 unit(s)",
        "description": "Learn and apply data analytics technologies and processes to large amount of data in various application domains; technologies include big data analytics algorithms, process and solutions, technology platforms, and data repositories; processes include validation, cleaning, preprocessing, and visualization.",
        "prereqs": "No prerequisites",
        "coreqs": "DATA 228 or instructor consent.",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "DATA 255 - Deep Learning Technologies",
        "units": "3 unit(s)",
        "description": "Study deep learning theory, techniques and technologies; implement neural networks using deep learning frameworks to solve problems in various application domains; build convolutional networks for image recognition, recurrent networks for sequence generation, and generative adversarial networks for image generation.",
        "prereqs": "DATA 245 or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "DATA 260 - Applied Intelligent Systems",
        "units": "Units not found",
        "description": "Description not found",
        "prereqs": "DATA 240 and DATA 245 , or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "DATA 270 - Data Analytics Processes",
        "units": "3 unit(s)",
        "description": "Data analytics processes to complete project lifecycle; project scope, requirements and management; data planning and exploration; model selection, development and presentation; results evaluation and visualization; planning and analyzing processes of data analytics projects through case studies of various domains. Satisfies GWAR: Graduation Writing Assessment Requirement.",
        "prereqs": "DATA 225 or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "This course satisfies graduate-level GWAR in this masters program."
    },
    {
        "title": "DATA 294 - Data Analytics Seminar",
        "units": "3 unit(s)",
        "description": "Advanced and domain specific topics in the area of data analytics; content is updated in each offering; possible topics include though not restricted to research design and data analytics for the applications of business, engineering, natural science, social science, etc.",
        "prereqs": "Graduate standing and instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "DATA 295 - Special Problems in Data Analytics",
        "units": "1-3 unit(s)",
        "description": "Advanced individual work in data analytics. Repeatable with graduate advisor approval.",
        "prereqs": "Instructor and graduate advisor consents.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Grade",
        "note": "No additional notes"
    },
    {
        "title": "DATA 296 - Special Topics in Data Analytics",
        "units": "1-3 unit(s)",
        "description": "Special topics in Data Analytics. Content varies from semester to semester. Repeatable in different topic areas. Course may be repeated for up to 9 units.",
        "prereqs": "Instructor Consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "DATA 297 - Data Analytics Internship",
        "units": "1 unit(s)",
        "description": "Fieldwork for MS in Data Analytics students. A report is required at the end of the semester addressing the goals set at the start of the assignment.",
        "prereqs": "Completed 12 units degree required courses, classified status, in good standing, and graduate advisor consent",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "No additional notes"
    },
    {
        "title": "DATA 298A - MSDA Project I",
        "units": "3 unit(s)",
        "description": "Comprehensive plan and preliminary design of data analytics project; integration of knowledge in technologies, processes and management to support program outcomes. 9 hours lab.",
        "prereqs": "Classified status, good standing, DATA 270 , completed 12 units of MSDA courses, and graduate advisor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "DATA 298B - MSDA Project II",
        "units": "3 unit(s)",
        "description": "Completion of an in-depth project to achieve the program outcomes and satisfy the culminating experience; write a detailed project report; make a comprehensive presentation and demonstration.",
        "prereqs": "Advancement to candidacy, DATA 298A , and graduate advisor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "DATA 299A - MSDA Thesis I",
        "units": "3 unit(s)",
        "description": "First of a two-course sequence for the Plan A (Thesis) culminating experience.",
        "prereqs": "Classified status, good standing, DATA 270 , completed 12 units of MSDA courses, and graduate advisor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "No additional notes"
    },
    {
        "title": "DATA 299B - MSDA Thesis II",
        "units": "3 unit(s)",
        "description": "Second of the two-course sequence for the Plan A (Thesis) culminating experience.",
        "prereqs": "Advancement to candidacy, DATA 299A , and graduate advisor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Mandatory Credit/No Credit/RP",
        "note": "No additional notes"
    },
    {
        "title": "STAT 95 - Elementary Statistics",
        "units": "3 unit(s)",
        "description": "Hypothesis testing and predictive techniques to facilitate decision-making; organization and classification of data, descriptive and inferential statistics, central tendency, variability, probability and sampling distributions, graphic representation, correlation and regression, chi-square, t-tests, and analysis of variance. Computer use in analysis and interpretation. Satisfies B4: Mathematics/Quantitative Reasoning.",
        "prereqs": "Math Enrollment Category M-I or M-II, or for Categories III or IV, completion of a GE Area B4 course with a grade of C- or better.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Intended for Psychology majors and minors as well as for programs in Behavioral Science, Child Development, Education, Health Science, Nursing, Nutritional Science, Social Science, and Social Work."
    },
    {
        "title": "STAT 115 - Intermediate Statistics",
        "units": "3 unit(s)",
        "description": "Statistical analysis at the intermediate level; chi-square, analysis of variance, correlation and regression, and topics in experimental design; use of microcomputers for statistical calculations.",
        "prereqs": "STAT 95 (or equivalent).",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Intended for majors in education, nursing, personnel administration, psychology, social service and sociology, and psychology minors."
    },
    {
        "title": "STAT 235 - Multivariate Analysis",
        "units": "3 unit(s)",
        "description": "Multivariate techniques for analyzing social science data with emphasis on multiple regression, multivariate analysis of variance, factor analysis, discriminant analysis and canonical correlation.",
        "prereqs": "Instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "STAT 245 - Advanced Statistics",
        "units": "3 unit(s)",
        "description": "Advanced problems in statistical analysis. Advanced consideration of hypothesis testing, estimation and analysis of variance.",
        "prereqs": "STAT 115 or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 15 - Careers in Engineering Technology",
        "units": "3 unit(s)",
        "description": "Introduce students to career opportunities in Engineering Technology. Resume writing, internship seeking, sources of financial aid, Study Abroad, time management, project management, leadership skills, emerging technologies, product design and patents, guest speakers and related industry tours.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 20A - Computer-Aided-Graphics",
        "units": "2 unit(s)",
        "description": "Introduction to Computer-Aided-Graphical communication tools. Orthographic projections, section and auxiliary views and dimensioning standards. Development of visualization and technical sketching skills in conjunction with orthographic and pictorial projections. Dimensioning and tolerancing utilizing 2D and 3D commercially available software. Misc/Lab: 1 hour lecture and 3 hours lab",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 25 - Introduction to Materials Science and Technology",
        "units": "3 unit(s)",
        "description": "Introduction to materials science including atomic and crystal structures; imperfections and atom movement; phase equilibria and transformations; boundaries; heat treatment of metals; mechanical, physical and chemical properties of materials. Laboratory exercises on processing, microstructure, and properties of engineering materials. Lecture 2 hours/lab 3 hours.",
        "prereqs": "MATH 18A or equivalent.",
        "coreqs": "CHEM 1A or CHEM 30A or equivalent.",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 30 - Introduction to Python Programming",
        "units": "3 unit(s)",
        "description": "Introduction to Python programming, data types, arithmetic and strings, conditional execution, loops, functions, lists and files, exception handling, sets and dictionaries.",
        "prereqs": "MATH 71 or MATH 71X or MATH 30 or MATH 30X .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 31 - Quality Assurance and Control",
        "units": "3 unit(s)",
        "description": "Introduction to concepts and statistical methods that companies use to manage and improve quality. Sampling inspection, statistical process control, quality function deployment, cost of quality, design of experiment and Taguchis method for designing in quality.",
        "prereqs": "BUS2 90 or equivalent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 41 - Machine Shop Operations and Safety",
        "units": "1 unit(s)",
        "description": "Introduction to basic machine shop safety and skills. Fabrication of mechanical components and assemblies from engineering drawings, performing tolerance inspection and developing fabrication process plans. 3 hours lab.Course is repeatable for up to 3 units.",
        "prereqs": "ME 20 or TECH 20A or CE 20 or equivalent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Cross-listed with ME 41 . Technology is responsible for scheduling.",
        "note": "No additional notes"
    },
    {
        "title": "TECH 42 - Manufacturing and Machine Shop Projects and Practices",
        "units": "1 unit(s)",
        "description": "Individual manufacturing processes and machine shop practices. Fabrication of mechanical components and assemblies in fulfillment of senior, course, special, and approved student club assignments and projects. Misc/Lab: 3 hours labCourse may be repeated for credit for up to 4 units.",
        "prereqs": "TECH 41 /ME 41 (with grade C- or better).",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit Cross-listed with ME 42 . Technology is responsible for scheduling.",
        "note": "No additional notes"
    },
    {
        "title": "TECH 45 - Facilities Design & Planning",
        "units": "3 unit(s)",
        "description": "Construction, planning, and maintenance of physical facilities and equipment for manufacturing operations. Sustainable practices and standards, plant facilities layout/design, regulatory and environmental compliance, safety/security, energy conservation. Production line planning and OSHA and NIOSH standards.",
        "prereqs": "TECH 20A , CE 20 , ME 20 , or equivalent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Sustainability Focused - SDG 12: Responsible Consumption and Production",
        "note": "No additional notes"
    },
    {
        "title": "TECH 46 - Machine Operations and Management",
        "units": "3 unit(s)",
        "description": "Machining processes using computer-numerically-controlled and manual machines, including turning, milling, drilling, grinding, and sawing machines. Manual and computer-aided part programming. Management of machining environment including processes, tooling, instruments, equipment, personnel, and safety. Lecture 2 hours/lab 3 hours.",
        "prereqs": "TECH 41 or ME 41 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 60 - Introduction to Electronics",
        "units": "3 unit(s)",
        "description": "Emphasizes practical electronics applications and products. DC and AC theory; Ohms Law, Kirchhoffs Laws, Power Laws, network theorems, schematic diagrams, instrumentation and measurement, and functions of discrete components. Lecture 2 hours/lab 3 hours.Pre/",
        "prereqs": "No prerequisites",
        "coreqs": "MATH 71 or MATH 71X or MATH 30 or MATH 30X or equivalent.",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 62 - Analog Circuits",
        "units": "3 unit(s)",
        "description": "Semiconductor theory; p-n junction, bipolar transistors, JFETs and MOSFETs, optoelectronic devices. Operational amplifiers and 555 timers. Device applications: comparators, signal generators, active filters, instrumentation amplifiers, voltage regulators and power supplies. Lecture 2 hours/lab 3 hours.",
        "prereqs": "TECH 60 , MATH 71 or MATH 71X or MATH 30 or MATH 30X .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 63 - Analog and Digital Circuits",
        "units": "3 unit(s)",
        "description": "Logic gates emphasizing TTL and CMOS. Design techniques. Combinational circuits, counters, registers, multiplexers, Semiconductor theory. Operational amplifiers. Device applications, signal generators, voltage regulators and power supplies.",
        "prereqs": "TECH 60 , MATH 71 MATH 71X or MATH 30 MATH 30X or equivalent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "Lecture 2 hours/lab 3 hours."
    },
    {
        "title": "TECH 65 - Introduction to Networks",
        "units": "3 unit(s)",
        "description": "Introduces the architecture, structure, functions, components, and models of the Internet and other computer networks. The principles and structure of IP addressing and the fundamentals of Ethernet concepts, media, and operations are introduced. Students build simple LANs, perform basic configurations for routers and switches, and implement IP addressing schemes. Lecture 2 hours/Lab 3 hours.",
        "prereqs": "MATH 18A or eligible for MATH 19 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 66 - Network Administration",
        "units": "3 unit(s)",
        "description": "Internetworking devices and systems. Network Administration and Support. Enterprise and Distributed Networks. Wide-Area and Large Scale Networks. Solving Network problems. Using the Resources of the Internet. Future networking technologies. Telemeter networks. Manufacturing Automation. Systems Networks, Storage area network. Misc/Lab: Lecture 2 hours/Lab 3 hours.",
        "prereqs": "TECH 65 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 67 - Introduction to Internet of Things",
        "units": "3 unit(s)",
        "description": "Introduction to Internet of Things (IoT) fundamentals, development of the knowledge and skills required for related technologies and hands-on, problem-solving experience. Designing and connecting IoT devices to capture data and control the physical world. Misc/Lab: Lec 2 hours/Lab 3 hours.",
        "prereqs": "TECH 60 , TECH 65 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 68 - Internet of Things Systems",
        "units": "3 unit(s)",
        "description": "Cyber-physical systems as control systems, including problem formulation, mathematical representation, and analysis. IoT system components of switching, routing, security, wireless, virtualization, and their integration into end-to-end IoT systems. Lecture 2 hours/Lab 3 hours.",
        "prereqs": "TECH 67 .",
        "coreqs": "TECH 30 or CMPE 30 .",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 115 - Automation and Robotics",
        "units": "3 unit(s)",
        "description": "Theory and application of automation elements including analog and digital sensors, controllers, indicators, actuators. Control modes for proportional, derivative, and integral control systems. Hands-on integration practices among PLC, robots, automatic identification devices, computers, and other industrial equipment. Lecture 2 hours/lab 3 hours.",
        "prereqs": "TECH 60 ; MATH 71 or MATH 71X ; and, PHYS 2A & PHYS 2B , or PHYS 50 & PHYS 51 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 136 - Software Quality Management",
        "units": "3 unit(s)",
        "description": "Software quality management standard processes and techniques, certification standards. Web programming application. Mobile network applications. Software testing methodology. Role of software quality managers in a computer network system organization. 2 hours lecture/3 hours lab.",
        "prereqs": "TECH 30 or CMPE 30 , BUS2 90 , and TECH 173",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 140 - Product Design and Prototyping",
        "units": "3 unit(s)",
        "description": "Advanced product design employing 3D modelling technique. Measure impact of designs focusing on materials, manufacturing, product use and disposal. Projects based learning incorporating design intent, materials selection and advanced manufacturing technologies. Laboratory exercises for product design, development and fabrication. Lecture 2 hours/Lab 3 hours.",
        "prereqs": "TECH 20A or ME 20 ; CHEM 1A or CHEM 30B ; and, MATH 71 or MATH 71X or MATH 30 or MATH 30X .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded. Sustainability Focused - SDG 12: Responsible Consumption and Production",
        "note": "No additional notes"
    },
    {
        "title": "TECH 143 - Polymers and Composites Fabrication Technology",
        "units": "3 unit(s)",
        "description": "Fundamental aspects of modern manufacturing technology using polymeric and composite materials. Hands-on activities in casting, molding, coating, thermoforming, and fiber reinforcement. Concepts of design, analysis, and fabrication.",
        "prereqs": "TECH 20A , CHEM 1A , and PHYS 2A .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 145 - Lean Manufacturing",
        "units": "3 unit(s)",
        "description": "Exploration and practice of techniques for reducing waste to optimize the value stream in both manufacturing and non-manufacturing environments. Toyota Production System, Value Stream Mapping, 7 Wastes, 5S, Just-in-Time, TPM, Kaizen.",
        "prereqs": "BUS2 90 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Sustainability Focused - SDG 12: Responsible Consumption and Production",
        "note": "No additional notes"
    },
    {
        "title": "TECH 146 - 3D Printing and Applications",
        "units": "3 unit(s)",
        "description": "Introduction to technologies in 3D printing, equipment, processes, and materials. Applications for a variety of markets and industry in accelerating time to market for products, improving manufacturing operations, and efficiency. Hands-on experience through CAD design to product realization.",
        "prereqs": "TECH 20A , TECH 25 , TECH 140",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 147 - Manufacturing Analysis & Management",
        "units": "3 unit(s)",
        "description": "Design, operation, and control of economic production systems using techniques to promote sustainability and minimize environmental impact. Emphasis on the physical design of high-performance manufacturing including production flow, scheduling, work flow, layout of manufacturing plants, and material handling. Lecture 2 hours/lab 3 hours.",
        "prereqs": "TECH 45 , TECH 46 , and TECH 115 .Pre/",
        "coreqs": "TECH 140 .",
        "grading_type": "Letter Graded Sustainability Focused - SDG 12: Responsible Consumption and Production",
        "note": "No additional notes"
    },
    {
        "title": "TECH 149 - Smart Manufacturing",
        "units": "3 unit(s)",
        "description": "Smart manufacturing including sensors used to facilitate Industrial IoT in machine monitoring, data analytics, digital twin modeling and visualization in production and workflow, smart automation, robotic delivery systems, use of machine learning, additive manufacturing, augmented reality, quality control in manufacturing, and industry tours. Lecture 2 hours/lab 3 hours.",
        "prereqs": "TECH 147 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Sustainability Related - SDG 12: Responsible Consumption and Production",
        "note": "No additional notes"
    },
    {
        "title": "TECH 163 - Telecommunications Systems",
        "units": "3 unit(s)",
        "description": "Communication systems. Types of Modulation. Transmitters and receivers. Digital communications. Data transmission. Digital modulation and modems. Multiplexing and multiple-assess techniques. Wireless communication systems. Microwave devices. Satellite communications. Fiber optics systems.",
        "prereqs": "TECH 62 , TECH 63 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 165 - Wireless Communications Technologies",
        "units": "3 unit(s)",
        "description": "Digital wireless technologies. RF Communications. Wireless Personal Area Networks. Wireless Local Area Networks. Wireless Metropolitan Area Networks. Wireless Satellite Fixed Broadband. Wireless Wide Area Networks. Radio Frequency Identification. Wireless Communication in Business. Emerging wireless technologies Lecture 3 hours/Lab 3 hours.",
        "prereqs": "TECH 63 , TECH 65 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 167 - Control Systems",
        "units": "3 unit(s)",
        "description": "Theory and applications of feedback systems, transfer functions and block diagrams. Transducers, analog and digital controllers, signal conditioners and transmission. Analysis, testing, and troubleshooting of electronic systems with feedback. Misc/Lab: Lecture 2 hours/lab 3 hours.",
        "prereqs": "TECH 63 , TECH 115 , and CMPE 30 or CS 49C or CS 49J .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 169 - Applied Electronic Design",
        "units": "3 unit(s)",
        "description": "Design, test, simulation, development and implementation of electronic systems for control of industrial processes using project management techniques and team work. Hardware, software, and system interfacing. Misc/Lab: Lecture 2 hours/lab 3 hours.Pre/",
        "prereqs": "No prerequisites",
        "coreqs": "TECH 167 .",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 170 - Connected Products Applications",
        "units": "3 unit(s)",
        "description": "Introduction to connected products and applications, defining user (UX) for web and software and UX for Connected Things. Presenting models of human-computer interaction, design processes and product/service definition and strategy. Cases studies of IoT systems and design.  Misc/Lab: Lec 2 hours/ Lab 3 hours.",
        "prereqs": "TECH 68 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 171 - Network Security & Prevention Management",
        "units": "3 unit(s)",
        "description": "Approaches to IT system security including physical, application, operating system, cyber-, and network security. Using switches, routers, adaptive security appliance, firewalls, and intrusion protection systems to implement comprehensive security policies. IPv4 and IPv6 security, VPN technology.",
        "prereqs": "TECH 170 or BUS4 111 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 172 - Database Server System Management",
        "units": "3 unit(s)",
        "description": "Practical big data analytics and management systems. Issues and problems involved in massive on-line repository systems. Current practical techniques for satisfying the needs of such systems. Current approaches that are likely to provide a basis for tomorrows solutions. Misc/Lab: Lec 2 hours/Lab 3 hours.",
        "prereqs": "TECH 171 , TECH 173 , TECH 179 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 173 - Cloud Computing System Management",
        "units": "3 unit(s)",
        "description": "Technologies, hardware and software applications in cloud computing. Implementation of cloud computing in the enterprise through exploration of public and private clouds, comparison. Performance monitoring of data traffic flow and process improvement for the required server systems.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 174 - Blockchain Technology and Applications",
        "units": "3 unit(s)",
        "description": "Fundamentals and applications of Blockchain Technology; transparent, secure, immutable and distributed database used as the underlying technology for Cryptocurrency. Types of Blockchain and real-life applications for potentially disruptive technology and its impact on business world and society.",
        "prereqs": "TECH 30 or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 175 - Industrial Internet of Things (IIoT)",
        "units": "3 unit(s)",
        "description": "Techniques to collect and analyze sensor data to maximize industrial systems efficiency through predictive and preventive maintenance, machines monitoring, supply-chain optimization, smart energy, smart grid, big data analytics, smart connected systems, and cyber threats prevention.",
        "prereqs": "TECH 30 and TECH 65 ; or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 176 - Machine Learning Technology and Applications",
        "units": "3 unit(s)",
        "description": "Overview of machine learning in computer network systems with emphasis on practical applications focusing on supervised and unsupervised techniques and methods, including classification and clustering. Emphasis on big data analytics and data mining.",
        "prereqs": "TECH 30 or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 177 - Data Science in Industrial Systems Management",
        "units": "3 unit(s)",
        "description": "Focus on applications of descriptive, predictive, and prescriptive analyses in pattern recognition, system improvement and optimization. Data mining techniques, decision tree modeling, regression analysis, and big data management for informed decision making in industrial systems management.",
        "prereqs": "TECH 31 or equivalent courses with instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 178 - Autonomous Systems Technology",
        "units": "3 unit(s)",
        "description": "Autonomous systems including vehicles, UAV, drones, warehouse and delivery systems, trucks, and shuttles. Review of the fundamental components of such autonomous systems including sensors, vision systems, actuators, embedded computing, intelligent control and predictive modeling, regulations, and ethics.",
        "prereqs": "TECH 115 or TECH 170 or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter graded.",
        "note": "No additional notes"
    },
    {
        "title": "TECH 179 - Cyber Security System Management",
        "units": "3 unit(s)",
        "description": "Key issue associated with protecting information assets. Levels of protection and response to security incidents. Planning for security and management of the system. Application of software, cryptography, encryption methods. Mobile and cloud systems security.",
        "prereqs": "TECH 171 or BUS4 111 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Sustainability Related",
        "note": "No additional notes"
    },
    {
        "title": "TECH 180A - Individual Studies in Electronics and Computer Technology",
        "units": "1-4 unit(s)",
        "description": "",
        "prereqs": "Upper division standing and instructor consent. Not available to Open University Students.",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "No additional notes"
    },
    {
        "title": "TECH 180B - Individual Studies in Manufacturing Technology",
        "units": "1-4 unit(s)",
        "description": "",
        "prereqs": "Upper division standing and instructor consent. Not available to Open University Students.",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "No additional notes"
    },
    {
        "title": "TECH 180J - Individual Studies in Technology Issues",
        "units": "1-4 unit(s)",
        "description": "",
        "prereqs": "Upper division standing and instructor consent. Not available to Open University Students.",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "No additional notes"
    },
    {
        "title": "TECH 190A - Senior Project I",
        "units": "3 unit(s)",
        "description": "Half of one-year senior team design projects. Professional development and proposal preparation with feasibility plans, specifications, oral/written reports, and career and professional seminar participation. Project proceeds over two semesters from problem definition and design to validation, prototype construction, and testing.",
        "prereqs": "ENGR 100W with a grade of C or better and either TECH 115 and TECH 140 and TECH 147 , or TECH 170 and TECH 171 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "TECH 190A and TECH 190B sequence must be completed in the same academic year. Sustainability Related - SDG 12: Responsible Consumption and Production"
    },
    {
        "title": "TECH 190B - Senior Project II",
        "units": "3 unit(s)",
        "description": "Second half of a one-year team project carried out under faculty supervision. Construction, testing, and evaluation of the design from TECH 190A , culminating in demonstrations and written and oral presentations to faculty and peers.",
        "prereqs": "TECH 190A .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Sustainability Related - SDG 12: Responsible Consumption and Production",
        "note": "No additional notes"
    },
    {
        "title": "TECH 192 - International Program Studies",
        "units": "1-14 unit(s)",
        "description": "Study Abroad and Away transfer credit course. Study Abroad and Away provides students the opportunity to study abroad on long term programs (Exchange Programs, CSU International Programs, and International Student Exchange Programs) and short-term programs (Faculty-Led Programs and Summer School Abroad Programs) for academic credit, offering Alternative Break Programs for cultural immersion, and designing other globally focused opportunities. This course is designated as a placeholder course for Study Abroad and Away programs.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Mixed Grading",
        "note": "No additional notes"
    },
    {
        "title": "TECH 195 - Cooperative Internship",
        "units": "1-3 unit(s)",
        "description": "Provides an educational strategy that links classroom learning and student interest with the acquisition of knowledge in an applied work setting. Students undertake a significant experiential learning opportunity, typically with a company, non-profit, governmental, or community-based organization.",
        "prereqs": "Upper division standing, course contract, instructor consent",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "No additional notes"
    },
    {
        "title": "TECH 198 - Technology and Civilization",
        "units": "3 unit(s)",
        "description": "History, development, and use of technology in different cultures. Technologys impact on society, global environment, the workplace, cultural values, gender roles, and newly industrialized countries of the world. Satisfies SJSU Studies V: Cultures and Global Understanding.",
        "prereqs": "Completion of Core General Education and upper division standing are prerequisites to all SJSU studies courses. Completion of, or co-registration in, 100W is strongly recommended.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded Cross-listed with CMPE 198 / ENGR 198 / ME 198 . Technology is responsible for scheduling. Sustainability Related - SDG 9: Industry, Innovation and Infrastructure",
        "note": "No additional notes"
    },
    {
        "title": "TECH 199A - Special Topics in Electronics & Cmp Tech",
        "units": "3 unit(s)",
        "description": "Fundamentals of being a successful college student on the path to a profession in Industrial Technology. Hands-on project oriented course with applications in manufacturing systems, robotics, plant operation, materials and handling, computer network systems, IoT, and internet hardware. Guest speakers and tours of related industries.  Course may be repeated for credit for up to 6 units.",
        "prereqs": "Instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 199B - Special Topics in Manufacturing Systems",
        "units": "3 unit(s)",
        "description": "Special topics in Manufacturing Systems. Content varies from semester to semester. Repeatable for a total of 6 units. Course may be repeated for credit for up to 6 units.",
        "prereqs": "Instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 200 - Research Methods for Engineering and Technology",
        "units": "3 unit(s)",
        "description": "Current applied research methods applied to problems in engineering, technology, and other technical fields. Exposure to current literature, scientific/technological research ethics, research and experimental design and methods, skills in research proposal development and locating funding.",
        "prereqs": "STAT 115 (or equivalent) and graduate standing.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 230 - Six-Sigma and Continuous Improvement Systems Management",
        "units": "3 unit(s)",
        "description": "Six-Sigma quality systems for design production and business processes. Statistical foundations, implementation strategies, and practical industrial applications. Methods and practices of achieving continuous quality improvement, defect reduction, project planning and management methods to achieve universal participation in process improvement.",
        "prereqs": "STAT 115 or equivalent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 231 - Systems Reliability and Maintainability",
        "units": "3 unit(s)",
        "description": "Analysis of models for systems reliability including static, dynamic, and probabilistic engineering models; reliability estimation and optimization, life cycle prediction techniques; failure modes and effects analysis; maintainability prediction and analysis.",
        "prereqs": "TECH 230 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 232 - Advanced Statistical Process Control",
        "units": "3 unit(s)",
        "description": "Analysis of advanced statistical process control (SPC) systems for monitoring and controlling process performance. Statistical methods for sample selection, probability theory, partition of variation, blanket studies, out-of-control action plans, process capability measurement, and SPC implementation strategies and analysis.",
        "prereqs": "STAT 115 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 233 - Design and Analysis of Experiments",
        "units": "3 unit(s)",
        "description": "Analysis of experimental design strategies for process and design improvement. Industrial application of single factor, multi-factor, and optimization designs. Experimental analysis using t-tests, ANOVA, Chi-square, linear and multiple regression techniques. Model building and model validation. Pre/",
        "prereqs": "No prerequisites",
        "coreqs": "TECH 232 .",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 234 - Quality Systems Management: ISO 9000 and 14000",
        "units": "3 unit(s)",
        "description": "Strategies for developing and implementing ISO standards: Project management and planning, cost estimation, supply chain management, audit plans and documentation systems for ISO system compliance. Analysis of ISO 9000 and 14000 quality systems for product design, development and production.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 235 - Measurement Systems and Analysis",
        "units": "3 unit(s)",
        "description": "Analysis of variables and attributes methods for measurement systems analysis and control including; repeatability, reproducibility, accuracy, linearity and stability. A survey of measurement and testing systems; dimensional metrology, destructive and nondestructive testing, calibration methods, and inspection equipment and techniques.",
        "prereqs": "TECH 232 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 236 - Foundations in Quality Assurance for Software",
        "units": "3 unit(s)",
        "description": "Analysis of software development strategies, design and configuration control systems, development standards, performance measurement, documentation and revision control systems, defect reduction methods, modular design approaches, and software maintainability.",
        "prereqs": "TECH 232 , TECH 200 , TECH 234 , and CS 46A or equivalent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 239 - Design Assurance in Product Development",
        "units": "3 unit(s)",
        "description": "Analysis of product development strategies, understanding design constraints and market conditions, design and configuration control systems, documentation and revision control systems, design for manufacturability, phase review approaches for new product introduction, design reviews, and developing and maintaining design guidelines.",
        "prereqs": "TECH 200 , TECH 230 and TECH 234 .",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 241 - Application of Artificial Intelligence in Manufacturing",
        "units": "3 unit(s)",
        "description": "Application of artificial intelligence in manufacturing ecosystems in predicting production and process rates, determination of accuracies, machinery performance analysis, and planning preventive maintenance to optimize system operation, through continuous data collection and analysis.",
        "prereqs": "TECH 30 and TECH 176 , or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 244 - Selective Laser Melting Process",
        "units": "3 unit(s)",
        "description": "Introduction to the latest developments and critical challenges of selective laser melting (SLM) process to provide relevant knowledge and practical experience in developing novel SLM process, equipment, and applications. Project based learning, emphasizing the principles of powder metallurgy in SLM of aerospace materials.",
        "prereqs": "TECH 146 or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter graded.",
        "note": "No additional notes"
    },
    {
        "title": "TECH 245 - Advanced Solid-State Welding/Joining Processes",
        "units": "3 unit(s)",
        "description": "Introduction to the latest developments and critical challenges of friction stir welding/joining and processing (FSW/J&P) to provide relevant knowledge and practical experience in developing novel FSW/J&P processes, equipment, and applications. Project based learning, focusing on the process principle, metallurgical, and mechanical aspects of FSW/J&P.",
        "prereqs": "TECH 140 or instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter graded.",
        "note": "No additional notes"
    },
    {
        "title": "TECH 251 - Cybersecurity Operations Management",
        "units": "3 unit(s)",
        "description": "Apply cybersecurity management principles to analyze cybersecurity policies; approaches to risk analysis; plan for business continuity and disaster recovery; practice incident response to prevent intrusions and attacks; exercise managing firewalls, cloud security, identity management, intrusion detection systems, cryptography, and VPNs.",
        "prereqs": "Graduate Standing and Instructor Consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter graded.",
        "note": "No additional notes"
    },
    {
        "title": "TECH 273 - Computer and Network System Auditing",
        "units": "3 unit(s)",
        "description": "Emphasis on information security and security management, computer crime, legal issues, controls and auditing systems, scanning threat reporting. Evaluations of security infrastructures in a controlled environment using vulnerability assessment tools to assess risks and evaluate security controls on the network.",
        "prereqs": "Graduate Standing and Instructor Consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter Graded",
        "note": "No additional notes"
    },
    {
        "title": "TECH 290 - Graduate Problems",
        "units": "2-4 unit(s)",
        "description": "Graduate study or research of technical problems.",
        "prereqs": "TECH 200 and instructor consent. Not available to Open University Students.",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit",
        "note": "No additional notes"
    },
    {
        "title": "TECH 295A - Engineering Technology Project I",
        "units": "3 unit(s)",
        "description": "Advanced individual work in Engineering Technology, including but not limited to research, development, simulation, and/or fabrication and test. TECH 295A is the first semester of a two-semester long graduate project.",
        "prereqs": "Advancement to candidacy for the masters degree and instructor consent.",
        "coreqs": "No corequisites",
        "grading_type": "Letter graded.",
        "note": "No additional notes"
    },
    {
        "title": "TECH 295B - Engineering Technology Project II",
        "units": "3 unit(s)",
        "description": "Continuation of TECH 295A. Students complete the in-depth project, write a technical report, and make a comprehensive presentation.",
        "prereqs": "No prerequisites",
        "coreqs": "No corequisites",
        "grading_type": "Letter graded.",
        "note": "No additional notes"
    },
    {
        "title": "TECH 298 - Graduate Project",
        "units": "2-4 unit(s)",
        "description": "Graduate study research of professional problems.",
        "prereqs": "Advancement to candidacy for the masters degree and instructor consent. Not available to Open University Students.",
        "coreqs": "No corequisites",
        "grading_type": "Mandatory Credit/No Credit/RP",
        "note": "No additional notes"
    },
    {
        "title": "TECH 299 - Masters Thesis",
        "units": "2-6 unit(s)",
        "description": "",
        "prereqs": "Advancement to candidacy for the masters degree and instructor consent. Not available to Open University Students.",
        "coreqs": "No corequisites",
        "grading_type": "Mandatory Credit/No Credit/RP",
        "note": "No additional notes"
    },
    {
        "title": "TECH 1290R - Culminating Experience Supervision",
        "units": "1 unit(s)",
        "description": "Continued work on thesis or project. Course may be repeated for credit for up to 16 units.",
        "prereqs": "Outstanding RP grade in a preceding semester in a project or thesis class",
        "coreqs": "No corequisites",
        "grading_type": "Credit/No Credit/No Degree Credit",
        "note": "No Degree Credit."
    }
]